-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Apr 01, 2024 at 06:56 PM
-- Server version: 5.7.33
-- PHP Version: 7.4.19

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `pascal_store`
--

-- --------------------------------------------------------

--
-- Table structure for table `addresses`
--

CREATE TABLE `addresses` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` int(11) NOT NULL,
  `first_name` varchar(255) NOT NULL,
  `last_name` varchar(255) NOT NULL,
  `city_id` int(10) UNSIGNED NOT NULL,
  `mobile` varchar(12) NOT NULL,
  `post_code` varchar(10) NOT NULL,
  `address` varchar(1000) NOT NULL,
  `is_default` enum('yes','no') NOT NULL DEFAULT 'yes',
  `status` enum('active','inactive') NOT NULL DEFAULT 'active',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `addresses`
--

INSERT INTO `addresses` (`id`, `user_id`, `first_name`, `last_name`, `city_id`, `mobile`, `post_code`, `address`, `is_default`, `status`, `created_at`, `updated_at`) VALUES
(72, 1, 'شایان', 'نیک روش', 925, '09152353281', '43434', 'خیابون بوستان', 'yes', 'active', '2023-12-02 14:21:57', '2024-02-05 18:19:41'),
(77, 2, 'پوری', 'آزاد', 162, '09908595090', '43434', 'سبزوار', 'no', 'active', '2023-12-07 18:39:19', '2023-12-08 10:43:11'),
(82, 1, 'پوری', 'نهته', 1, '09908595090', '43434', 'سبزوار', 'no', 'active', '2023-12-10 14:43:23', '2024-02-05 18:19:41'),
(83, 1, 'پوری', 'نهته', 1, '09152353281', '43434', 'سسیس', 'no', 'active', '2023-12-12 14:02:33', '2024-02-03 09:09:37');

-- --------------------------------------------------------

--
-- Table structure for table `address_order`
--

CREATE TABLE `address_order` (
  `id` int(11) NOT NULL,
  `order_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `first_name` varchar(255) CHARACTER SET utf8 NOT NULL,
  `last_name` char(255) CHARACTER SET utf8 NOT NULL,
  `mobile` char(255) CHARACTER SET utf8 NOT NULL,
  `postal_code` char(255) CHARACTER SET utf8 NOT NULL,
  `city_id` int(11) NOT NULL,
  `address` varchar(1000) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `address_order`
--

INSERT INTO `address_order` (`id`, `order_id`, `user_id`, `first_name`, `last_name`, `mobile`, `postal_code`, `city_id`, `address`) VALUES
(1, 8, 1, 'شایان', 'نیک روش', '09152353281', '43434', 925, 'خیابون بوستان');

-- --------------------------------------------------------

--
-- Table structure for table `aritcle_photo`
--

CREATE TABLE `aritcle_photo` (
  `id` int(11) NOT NULL,
  `photo_id` int(11) NOT NULL,
  `article_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `aritcle_photo`
--

INSERT INTO `aritcle_photo` (`id`, `photo_id`, `article_id`) VALUES
(2, 12, 2),
(6, 46, 1);

-- --------------------------------------------------------

--
-- Table structure for table `articles`
--

CREATE TABLE `articles` (
  `id` int(11) NOT NULL,
  `first_name` tinytext CHARACTER SET utf8 NOT NULL,
  `last_name` tinytext CHARACTER SET utf8 NOT NULL,
  `title` tinytext CHARACTER SET utf8 NOT NULL,
  `english_title` tinytext CHARACTER SET utf8 NOT NULL,
  `status` enum('active','inactive') CHARACTER SET utf8 NOT NULL DEFAULT 'inactive',
  `article` longtext CHARACTER SET utf8 NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `articles`
--

INSERT INTO `articles` (`id`, `first_name`, `last_name`, `title`, `english_title`, `status`, `article`, `created_at`, `updated_at`) VALUES
(1, 'شایان', 'نیک روش', 'سایت', 'arc', 'active', '<p>سلام</p>', '2024-01-03 12:44:17', '2024-01-03 12:44:17'),
(2, 'شایان', 'نهته', 'سایت', 'site', 'active', '<p>سلام</p>', '2024-01-03 12:47:02', '2024-01-03 12:47:02');

-- --------------------------------------------------------

--
-- Table structure for table `banners`
--

CREATE TABLE `banners` (
  `id` int(40) NOT NULL,
  `title` tinytext CHARACTER SET utf8 NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `banners`
--

INSERT INTO `banners` (`id`, `title`, `created_at`) VALUES
(1, 'carousel', '2023-10-17 14:26:55'),
(2, 'small_banner', '2023-10-17 14:27:30'),
(3, 'med_banner', '2023-10-17 14:28:15');

-- --------------------------------------------------------

--
-- Table structure for table `banner_photo`
--

CREATE TABLE `banner_photo` (
  `id` int(11) NOT NULL,
  `photo_id` int(11) NOT NULL,
  `banner_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `banner_photo`
--

INSERT INTO `banner_photo` (`id`, `photo_id`, `banner_id`) VALUES
(21, 56, 1),
(22, 57, 1),
(23, 58, 2),
(24, 59, 3),
(25, 60, 3);

-- --------------------------------------------------------

--
-- Table structure for table `brands`
--

CREATE TABLE `brands` (
  `id` int(11) NOT NULL,
  `title` text NOT NULL,
  `english_title` text NOT NULL,
  `status` enum('active','inactive') NOT NULL DEFAULT 'inactive',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `brands`
--

INSERT INTO `brands` (`id`, `title`, `english_title`, `status`, `created_at`, `updated_at`) VALUES
(1, 'ایسوز', 'asus', 'active', '2023-09-24 18:48:20', '2023-11-14 15:35:16'),
(2, 'لنوو', 'lenovo', 'active', '2023-10-05 08:09:39', '2023-10-05 08:46:29');

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `parent_id` int(11) DEFAULT NULL,
  `title` text NOT NULL,
  `english_title` text NOT NULL,
  `status` enum('active','inactive') NOT NULL DEFAULT 'inactive',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `parent_id`, `title`, `english_title`, `status`, `created_at`, `updated_at`) VALUES
(1, NULL, 'لوازم خونگی', 'homeappliance', 'inactive', '2022-11-09 14:15:43', '2024-01-29 08:44:24'),
(5, NULL, 'لوازم منزل', 'home', 'active', '2023-10-05 07:17:11', '2023-10-10 15:50:52'),
(6, 1, 'یخچال', 'freezer', 'active', '2023-10-11 07:38:05', '2023-10-11 15:08:17'),
(7, 5, 'گاز', 'gaz', 'active', '2023-10-22 15:14:22', '2023-12-13 15:13:21');

-- --------------------------------------------------------

--
-- Table structure for table `cities`
--

CREATE TABLE `cities` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `province_id` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `cities`
--

INSERT INTO `cities` (`id`, `name`, `province_id`) VALUES
(1, 'تبریز', 2),
(2, 'مراغه', 2),
(3, 'مرند', 2),
(4, 'میانه', 2),
(5, 'اهر', 2),
(6, 'بناب', 2),
(7, 'شهر جدید سهند', 2),
(8, 'سراب', 2),
(9, 'آبش احمد', 2),
(10, 'آچاچی', 2),
(11, 'آذرشهر', 2),
(12, 'آقکند', 2),
(13, 'ابرغان', 2),
(14, 'اتش بیگ', 2),
(15, 'اچاچی', 2),
(16, 'اذغان (ازغان )', 2),
(17, 'اربط', 2),
(18, 'اردها', 2),
(19, 'ارسگنای سفلی', 2),
(20, 'ارموداق', 2),
(21, 'اروق', 2),
(22, 'اسبفروشان', 2),
(23, 'اسکلو (اسگلو)', 2),
(24, 'اسکو', 2),
(25, 'اغ زیارت', 2),
(26, 'اغچه ریش', 2),
(27, 'اغمیون', 2),
(28, 'افیل', 2),
(29, 'اق براز', 2),
(30, 'اق منار', 2),
(31, 'الانق', 2),
(32, 'القو', 2),
(33, 'امند', 2),
(34, 'اوشندل', 2),
(35, 'ایلخچی', 2),
(36, 'باسمنج', 2),
(37, 'بایقوت', 2),
(38, 'بخشایش', 2),
(39, 'بستان آباد', 2),
(40, 'بناب جدید', 2),
(41, 'بناب مرند', 2),
(42, 'بیلوردی', 2),
(43, 'پورسخلو', 2),
(44, 'ترک', 2),
(45, 'ترکمانچای', 2),
(46, 'تسوج', 2),
(47, 'تیکمه داش', 2),
(48, 'تیل', 2),
(49, 'تیمورلو', 2),
(50, 'جلفا', 2),
(51, 'جوان قلعه', 2),
(52, 'چول قشلاقی', 2),
(53, 'خاتون اباد-آذربایجان شرقی', 2),
(54, 'خاروانا', 2),
(55, 'خاص اباد (خاصبان )', 2),
(56, 'خامنه', 2),
(57, 'خانه برق قدیم (شورخانه ب', 2),
(58, 'خانیان', 2),
(59, 'خداجو', 2),
(60, 'خراجو', 2),
(61, 'خسرو شهر', 2),
(62, 'خسروشاه', 2),
(63, 'خضرلو', 2),
(64, 'خلجان', 2),
(65, 'خمارلو', 2),
(66, 'خواجه', 2),
(67, 'خوشه مهر (خواجه امیر)', 2),
(68, 'داران-آذربایجان شرقی', 2),
(69, 'داش اتان', 2),
(70, 'داش بلاغ بازار', 2),
(71, 'دانالو', 2),
(72, 'دوزدوزان', 2),
(73, 'دولت اباد-آذربایجان شرقی', 2),
(74, 'ذاکرکندی', 2),
(75, 'ذوالبین', 2),
(76, 'رازلیق', 2),
(77, 'رحمانلو', 2),
(78, 'روشت بزرگ', 2),
(79, 'زاوشت', 2),
(80, 'زرنق', 2),
(81, 'زنوز', 2),
(82, 'زوارق', 2),
(83, 'سرای (سرای ده )', 2),
(84, 'سردرود', 2),
(85, 'سرند', 2),
(86, 'سعیداباد-آذربایجان شرقی', 2),
(87, 'سلطان اباد (س انمکزار', 2),
(88, 'سلوک', 2),
(89, 'سیس', 2),
(90, 'سیه رود', 2),
(91, 'سیه کلان', 2),
(92, 'شادبادمشایخ (پینه شلوا', 2),
(93, 'شبستر', 2),
(94, 'شجاع', 2),
(95, 'شربیان', 2),
(96, 'شرفخانه', 2),
(97, 'شند آباد', 2),
(98, 'شهرک صنعتی کاغذکنان', 2),
(99, 'شیخدراباد', 2),
(100, 'شیراز-آذربایجان شرقی', 2),
(101, 'شیرامین', 2),
(102, 'صوفیان', 2),
(103, 'صومعه', 2),
(104, 'طوراغای (طوراغایی )', 2),
(105, 'عاشقلو', 2),
(106, 'عجب شیر', 2),
(107, 'علویان', 2),
(108, 'علی ابادعلیا', 2),
(109, 'قدمگاه (بادام یار)', 2),
(110, 'قره آغاج', 2),
(111, 'قره بابا', 2),
(112, 'قره بلاغ-آذربایجان شرقی', 2),
(113, 'قره چای حاج علی', 2),
(114, 'قره چمن', 2),
(115, 'قلعه حسین اباد', 2),
(116, 'قوچ احمد', 2),
(117, 'قویوجاق', 2),
(118, 'کجوار', 2),
(119, 'کردکندی', 2),
(120, 'کشکسرای', 2),
(121, 'کلوانق', 2),
(122, 'کلیبر', 2),
(123, 'کندرود', 2),
(124, 'کندوان', 2),
(125, 'کنگاور-آذربایجان شرقی', 2),
(126, 'کوزه کنان', 2),
(127, 'کهنمو', 2),
(128, 'گل تپه-آذربایجان شرقی', 2),
(129, 'گلین قیه', 2),
(130, 'گوگان', 2),
(131, 'گوندوغدی', 2),
(132, 'لاریجان', 2),
(133, 'لاهیجان-آذربایجان شرقی', 2),
(134, 'لکلر', 2),
(135, 'لیلان', 2),
(136, 'مایان سفلی', 2),
(137, 'مبارک شهر', 2),
(138, 'ملکان', 2),
(139, 'ممقان', 2),
(140, 'مولان', 2),
(141, 'مهربان', 2),
(142, 'مهماندار', 2),
(143, 'مینق', 2),
(144, 'نصیرابادسفلی', 2),
(145, 'نظرکهریزی', 2),
(146, 'نوجه مهر', 2),
(147, 'وایقان', 2),
(148, 'ورجوی', 2),
(149, 'ورزقان', 2),
(150, 'ورگهان', 2),
(151, 'هادیشهر', 2),
(152, 'هرزندجدید (چای هرزند)', 2),
(153, 'هریس', 2),
(154, 'هشترود', 2),
(155, 'هفت چشمه-آذربایجان شرقی', 2),
(156, 'هوراند', 2),
(157, 'یامچی', 2),
(158, 'یکان کهریز', 2),
(159, 'ینگجه', 2),
(160, 'ینگی اسپران (سفیدان جد', 2),
(161, 'یوزبند', 2),
(162, 'ارومیه', 3),
(163, 'خوی', 3),
(164, 'میاندوآب', 3),
(165, 'مهاباد', 3),
(166, 'بوکان', 3),
(167, 'سلماس', 3),
(168, 'ماکو', 3),
(169, 'نقده', 3),
(170, 'آواجیق', 3),
(171, 'ابگرم-آذربایجان غربی', 3),
(172, 'احمدابادسفلی', 3),
(173, 'احمدغریب', 3),
(174, 'اختتر', 3),
(175, 'استران', 3),
(176, 'اسلام اباد-آذربایجان غربی', 3),
(177, 'اشنویه', 3),
(178, 'اغ برزه', 3),
(179, 'اقابیگ', 3),
(180, 'اقبال', 3),
(181, 'اگریقاش', 3),
(182, 'الی چین', 3),
(183, 'امام کندی', 3),
(184, 'اوزون دره علیا', 3),
(185, 'اوغول بیگ', 3),
(186, 'ایبلو', 3),
(187, 'ایواوغلی', 3),
(188, 'باراندوز', 3),
(189, 'باروق', 3),
(190, 'بازرگان', 3),
(191, 'باغچه', 3),
(192, 'بدلان', 3),
(193, 'بسطام-آذربایجان غربی', 3),
(194, 'بگتاش', 3),
(195, 'بلسورسفلی', 3),
(196, 'بهله', 3),
(197, 'بیکوس', 3),
(198, 'بیگم قلعه', 3),
(199, 'بیله وار', 3),
(200, 'بیوران سفلی', 3),
(201, 'پسوه', 3),
(202, 'پلدشت', 3),
(203, 'پیرانشهر', 3),
(204, 'تازه شهر', 3),
(205, 'تک اغاج', 3),
(206, 'تکاب', 3),
(207, 'تمر', 3),
(208, 'تویی', 3),
(209, 'جلدیان', 3),
(210, 'جوانمرد', 3),
(211, 'چورس', 3),
(212, 'چهار برج', 3),
(213, 'چهریق علیا', 3),
(214, 'چیانه', 3),
(215, 'حاجی حسن', 3),
(216, 'حاجی کند', 3),
(217, 'حسن کندی', 3),
(218, 'حسنلو', 3),
(219, 'حمزه قاسم', 3),
(220, 'حیدرباغی', 3),
(221, 'خاتون باغ', 3),
(222, 'خلیفان', 3),
(223, 'خورخوره-آذربایجان غربی', 3),
(224, 'داراب-آذربایجان غربی', 3),
(225, 'دستجرد-آذربایجان غربی', 3),
(226, 'دلزی', 3),
(227, 'دورباش', 3),
(228, 'ده شمس بزرگ', 3),
(229, 'دیزج دول', 3),
(230, 'دیزج دیز', 3),
(231, 'دیزج-آذربایجان غربی', 3),
(232, 'راژان', 3),
(233, 'راهدانه', 3),
(234, 'ربط', 3),
(235, 'رحیم خان', 3),
(236, 'ریحانلوی علیا', 3),
(237, 'ریگ اباد', 3),
(238, 'زاویه سفلی', 3),
(239, 'زرآباد', 3),
(240, 'زمزیران', 3),
(241, 'زیوه', 3),
(242, 'سردشت', 3),
(243, 'سرنق', 3),
(244, 'سرو', 3),
(245, 'سنجی', 3),
(246, 'سوگلی تپه', 3),
(247, 'سیاقول علیا', 3),
(248, 'سیاوان', 3),
(249, 'سیلوانه', 3),
(250, 'سیلوه', 3),
(251, 'سیمینه', 3),
(252, 'سیه باز', 3),
(253, 'سیه چشمه', 3),
(254, 'شاهوانه', 3),
(255, 'شاهین دژ', 3),
(256, 'شلماش', 3),
(257, 'شوط', 3),
(258, 'شیخ احمد', 3),
(259, 'شیرین بلاغ', 3),
(260, 'شین اباد', 3),
(261, 'طلاتپه', 3),
(262, 'فیرورق', 3),
(263, 'قرنقو', 3),
(264, 'قره باغ', 3),
(265, 'قره تپه', 3),
(266, 'قره ضیاء الدین', 3),
(267, 'قره قشلاق', 3),
(268, 'قطور', 3),
(269, 'قم قشلاق', 3),
(270, 'قوروق', 3),
(271, 'قورول علیا', 3),
(272, 'قوزلوی افشار', 3),
(273, 'قوشچی', 3),
(274, 'کانسپی', 3),
(275, 'کاولان علیا', 3),
(276, 'کشاورز', 3),
(277, 'کله کین', 3),
(278, 'کهریزعجم', 3),
(279, 'گردکشانه', 3),
(280, 'گل تپه قورمیش', 3),
(281, 'گلاز', 3),
(282, 'گلیجه', 3),
(283, 'گوگ تپه خالصه', 3),
(284, 'گوگ تپه-آذربایجان غربی', 3),
(285, 'للکلو', 3),
(286, 'لولکان', 3),
(287, 'محمد یار', 3),
(288, 'محمود آباد', 3),
(289, 'مراکان', 3),
(290, 'مرگنلر', 3),
(291, 'ملاشهاب الدین', 3),
(292, 'ممکان', 3),
(293, 'موانا', 3),
(294, 'میاوق', 3),
(295, 'میرآباد', 3),
(296, 'نازک علیا', 3),
(297, 'نازلو', 3),
(298, 'نالوس', 3),
(299, 'نوشین', 3),
(300, 'وردان', 3),
(301, 'ولدیان', 3),
(302, 'هاچاسو', 3),
(303, 'هاشم اباد', 3),
(304, 'هندوان', 3),
(305, 'هنگ اباد', 3),
(306, 'هولاسو', 3),
(307, 'یکشوه', 3),
(308, 'یولاگلدی', 3),
(309, 'اردبیل', 4),
(310, 'پارس آباد', 4),
(311, 'خلخال', 4),
(312, 'مشگین شهر', 4),
(313, 'گرمی', 4),
(314, 'نمین', 4),
(315, 'بیله سوار', 4),
(316, 'گیوی', 4),
(317, 'آبی بیگلو', 4),
(318, 'اراللوی بزرگ', 4),
(319, 'اردیموسی', 4),
(320, 'اسلام آباد', 4),
(321, 'اسلام اباد-اردبیل', 4),
(322, 'اصلاندوز', 4),
(323, 'اق قباق علیا', 4),
(324, 'انجیرلو', 4),
(325, 'انی علیا', 4),
(326, 'بران علیا', 4),
(327, 'برندق', 4),
(328, 'بقراباد', 4),
(329, 'بودالالو', 4),
(330, 'پریخان', 4),
(331, 'تازه کند', 4),
(332, 'تازه کند انگوت', 4),
(333, 'تازه کندجدید', 4),
(334, 'ثمرین', 4),
(335, 'جعفر آباد', 4),
(336, 'حمزه خانلو', 4),
(337, 'خلفلو', 4),
(338, 'خورخورسفلی', 4),
(339, 'دیزج-اردبیل', 4),
(340, 'رضی', 4),
(341, 'زهرا', 4),
(342, 'سرعین', 4),
(343, 'شورگل', 4),
(344, 'شهرک غفاری', 4),
(345, 'عنبران', 4),
(346, 'فخرآباد', 4),
(347, 'فیروزاباد', 4),
(348, 'قاسم کندی', 4),
(349, 'قره اغاج پایین', 4),
(350, 'قشلاق اغداش کلام', 4),
(351, 'قصابه', 4),
(352, 'قوشه سفلی', 4),
(353, 'کلور', 4),
(354, 'کورائیم', 4),
(355, 'گرده', 4),
(356, 'گنجوبه', 4),
(357, 'گوشلو', 4),
(358, 'گوگ تپه-اردبیل', 4),
(359, 'لاهرود', 4),
(360, 'لنبر', 4),
(361, 'مرادلو', 4),
(362, 'مهماندوست علیا', 4),
(363, 'نظرعلی بلاغی', 4),
(364, 'ننه کران', 4),
(365, 'نیر', 4),
(366, 'هشتجین', 4),
(367, 'هیر', 4),
(368, 'اصفهان', 5),
(369, 'شاهین شهر', 5),
(370, 'کاشان', 5),
(371, 'نجف آباد', 5),
(372, 'بهارستان', 5),
(373, 'خمینی شهر', 5),
(374, 'فولادشهر', 5),
(375, 'شهرضا', 5),
(376, 'آران و بیدگل', 5),
(377, 'اب شیرین', 5),
(378, 'ابریشم', 5),
(379, 'ابوزید آباد', 5),
(380, 'ابیانه', 5),
(381, 'اذان', 5),
(382, 'اردستان', 5),
(383, 'اریسمان', 5),
(384, 'اژیه', 5),
(385, 'اسحق اباد-اصفهان', 5),
(386, 'اسفرجان', 5),
(387, 'اسکندری', 5),
(388, 'اسلام ابادموگویی', 5),
(389, 'اشکستان', 5),
(390, 'اشن', 5),
(391, 'اشیان', 5),
(392, 'اصغرآباد', 5),
(393, 'اغداش', 5),
(394, 'افوس', 5),
(395, 'امین اباد', 5),
(396, 'انارک', 5),
(397, 'اورگان-اصفهان', 5),
(398, 'اوره', 5),
(399, 'ایمانشهر', 5),
(400, 'بادرود', 5),
(401, 'باغ بهادران', 5),
(402, 'باغ ملک-اصفهان', 5),
(403, 'باغشاد', 5),
(404, 'بافران', 5),
(405, 'برزک', 5),
(406, 'برف انبار', 5),
(407, 'بلان', 5),
(408, 'بلطاق', 5),
(409, 'بوئین میاندشت', 5),
(410, 'بوئین و میاندشت', 5),
(411, 'بهاران شهر', 5),
(412, 'بیاضه', 5),
(413, 'پادگان اموزشی امام ص', 5),
(414, 'پالایشگاه اصفهان', 5),
(415, 'پرزان', 5),
(416, 'پلی اکریل', 5),
(417, 'پوده', 5),
(418, 'پیر بکران', 5),
(419, 'تاسیسات سدنکواباد', 5),
(420, 'تلک اباد', 5),
(421, 'تودشک', 5),
(422, 'تورزن', 5),
(423, 'تیدجان', 5),
(424, 'تیران', 5),
(425, 'تیرانچی', 5),
(426, 'تیکن', 5),
(427, 'جندق', 5),
(428, 'جوجیل', 5),
(429, 'جوزدان', 5),
(430, 'جوشقان استرک', 5),
(431, 'جوشقان قالی', 5),
(432, 'جوشقان و کامو', 5),
(433, 'چادگان', 5),
(434, 'چاه غلامرضارحیمی', 5),
(435, 'چرمهین', 5),
(436, 'چشمه رحمان', 5),
(437, 'چم نور', 5),
(438, 'چمگردان', 5),
(439, 'چوپانان', 5),
(440, 'چهارراه', 5),
(441, 'حاجی اباد', 5),
(442, 'حبیب آباد', 5),
(443, 'حسن آباد', 5),
(444, 'حسن اباد-اصفهان', 5),
(445, 'حسین اباد-اصفهان', 5),
(446, 'حنا', 5),
(447, 'خالد آباد', 5),
(448, 'خسرواباد-اصفهان', 5),
(449, 'خشکرود-اصفهان', 5),
(450, 'خم پیچ', 5),
(451, 'خوانسار', 5),
(452, 'خوانسارک', 5),
(453, 'خور', 5),
(454, 'خوراسگان', 5),
(455, 'خورزوق', 5),
(456, 'خونداب', 5),
(457, 'خیراباد-اصفهان', 5),
(458, 'داران', 5),
(459, 'دامنه', 5),
(460, 'درچه پیاز', 5),
(461, 'درقه', 5),
(462, 'دستجا', 5),
(463, 'دستگرد', 5),
(464, 'دولت آباد', 5),
(465, 'ده زیره', 5),
(466, 'ده نسا سفلی', 5),
(467, 'دهاقان', 5),
(468, 'دهسرخ', 5),
(469, 'دهق', 5),
(470, 'دیزیچه', 5),
(471, 'رباطاقاکمال', 5),
(472, 'رحق', 5),
(473, 'رحمت اباد', 5),
(474, 'رزوه', 5),
(475, 'رضوانشهر', 5),
(476, 'زازران', 5),
(477, 'زاینده رود', 5),
(478, 'زرنجان', 5),
(479, 'زرنه-اصفهان', 5),
(480, 'زرین شهر', 5),
(481, 'زواره', 5),
(482, 'زیار', 5),
(483, 'زیباشهر', 5),
(484, 'سازمان عمران زاینده رود', 5),
(485, 'سده لنجان', 5),
(486, 'سعادت اباد', 5),
(487, 'سعیداباد-اصفهان', 5),
(488, 'سفید شهر', 5),
(489, 'سگزی', 5),
(490, 'سمیرم', 5),
(491, 'سن سن', 5),
(492, 'سنگ سفید', 5),
(493, 'سولار', 5),
(494, 'سهروفیروزان', 5),
(495, 'سین', 5),
(496, 'شاپورآباد', 5),
(497, 'شرودان', 5),
(498, 'شهر ابریشم', 5),
(499, 'شهراب-اصفهان', 5),
(500, 'شهرک صنایع شیمیایی ر', 5),
(501, 'طالخونچه', 5),
(502, 'طرق رود', 5),
(503, 'ظفرقند', 5),
(504, 'عزیزاباد-اصفهان', 5),
(505, 'عسگران', 5),
(506, 'علویجه', 5),
(507, 'علویچه', 5),
(508, 'غرغن', 5),
(509, 'فتح اباد-اصفهان', 5),
(510, 'فرخی', 5),
(511, 'فریدونشهر', 5),
(512, 'فسخود', 5),
(513, 'فلاورجان', 5),
(514, 'فوداز', 5),
(515, 'فولادمبارکه', 5),
(516, 'قرغن', 5),
(517, 'قره بلطاق', 5),
(518, 'قصرچم', 5),
(519, 'قلعه امیریه', 5),
(520, 'قلعه سرخ', 5),
(521, 'قمشلو', 5),
(522, 'قمصر', 5),
(523, 'قهجاورستان', 5),
(524, 'قهدریجان', 5),
(525, 'قهرود', 5),
(526, 'کاغذی', 5),
(527, 'کامو و چوگان', 5),
(528, 'کجان', 5),
(529, 'کچومثقال', 5),
(530, 'کچوییه', 5),
(531, 'کرچ', 5),
(532, 'کرچگان', 5),
(533, 'کرسگان', 5),
(534, 'کرکوند', 5),
(535, 'کریم اباد-اصفهان', 5),
(536, 'کلوچان', 5),
(537, 'کلهرود', 5),
(538, 'کلیشاد و سودرجان', 5),
(539, 'کمشجه', 5),
(540, 'کمشچه', 5),
(541, 'کمه', 5),
(542, 'کوچری', 5),
(543, 'کوشک', 5),
(544, 'کوهپایه', 5),
(545, 'کهرویه', 5),
(546, 'کهریزسنگ', 5),
(547, 'کهنگان', 5),
(548, 'گرگاب', 5),
(549, 'گرموک', 5),
(550, 'گز برخوار', 5),
(551, 'گلپایگان', 5),
(552, 'گلدشت', 5),
(553, 'گلشن', 5),
(554, 'گلشهر', 5),
(555, 'گورت', 5),
(556, 'گوگد', 5),
(557, 'لای بید', 5),
(558, 'مبارکه', 5),
(559, 'محمد آباد', 5),
(560, 'مرغ', 5),
(561, 'مزرعه صدر', 5),
(562, 'مزیک', 5),
(563, 'مشکات', 5),
(564, 'مشهدکاوه', 5),
(565, 'مصیر', 5),
(566, 'مقصودبیک', 5),
(567, 'ملازجان', 5),
(568, 'منطقه صنعتی محموداباد', 5),
(569, 'منظریه', 5),
(570, 'منوچهراباد', 5),
(571, 'موته', 5),
(572, 'مورچه خورت', 5),
(573, 'مورک', 5),
(574, 'موغار', 5),
(575, 'مهاباد', 5),
(576, 'مهراباد', 5),
(577, 'مهرجان', 5),
(578, 'مهرگرد', 5),
(579, 'مهیار', 5),
(580, 'میراباد-اصفهان', 5),
(581, 'میمه', 5),
(582, 'نائین', 5),
(583, 'نشلج', 5),
(584, 'نصرآباد', 5),
(585, 'نطنز', 5),
(586, 'نوش آباد', 5),
(587, 'نوگوران', 5),
(588, 'نهرخلج', 5),
(589, 'نهضت اباد', 5),
(590, 'نهوج', 5),
(591, 'نیاسر', 5),
(592, 'نیستانک', 5),
(593, 'نیسیان', 5),
(594, 'نیک آباد', 5),
(595, 'وادقان', 5),
(596, 'وانشان', 5),
(597, 'ورپشت', 5),
(598, 'ورزنه', 5),
(599, 'ورق', 5),
(600, 'ورنامخواست', 5),
(601, 'وزوان', 5),
(602, 'ومکان', 5),
(603, 'ونک', 5),
(604, 'ویست', 5),
(605, 'هرند', 5),
(606, 'هست', 5),
(607, 'همسار', 5),
(608, 'همگین', 5),
(609, 'کرج', 6),
(610, 'فردیس', 6),
(611, 'هشتگرد', 6),
(612, 'نظر آباد', 6),
(613, 'محمد شهر', 6),
(614, 'کمال شهر', 6),
(615, 'شهر جدید هشتگرد', 6),
(616, 'مشکین دشت', 6),
(617, 'آسارا', 6),
(618, 'ادران', 6),
(619, 'اشتهارد', 6),
(620, 'تنکمان', 6),
(621, 'چهارباغ', 6),
(622, 'سولقان', 6),
(623, 'طالقان', 6),
(624, 'قزل حصار', 6),
(625, 'کوهسار', 6),
(626, 'کیانمهر', 6),
(627, 'گرمدره', 6),
(628, 'گلسار', 6),
(629, 'مارلیک', 6),
(630, 'ماهدشت', 6),
(631, 'ایلام', 7),
(632, 'مهران', 7),
(633, 'دهلران', 7),
(634, 'ایوان', 7),
(635, 'آبدانان', 7),
(636, 'دره شهر', 7),
(637, 'سرابله', 7),
(638, 'ارکواز', 7),
(639, 'آسمان آباد', 7),
(640, 'اب انار', 7),
(641, 'ارمو', 7),
(642, 'بانویزه', 7),
(643, 'بدره', 7),
(644, 'بلاوه', 7),
(645, 'بلاوه تره سفلی', 7),
(646, 'بیشه دراز', 7),
(647, 'پاریاب', 7),
(648, 'پهله', 7),
(649, 'توحید', 7),
(650, 'چشمه شیرین', 7),
(651, 'چشمه کبود', 7),
(652, 'چم هندی', 7),
(653, 'چمن سیدمحمد', 7),
(654, 'چنارباشی', 7),
(655, 'چوار', 7),
(656, 'دشت عباس', 7),
(657, 'دلگشا', 7),
(658, 'دول کبودخوشادول', 7),
(659, 'زرنه', 7),
(660, 'ژیور', 7),
(661, 'سرآبله', 7),
(662, 'سراب باغ', 7),
(663, 'سراب کارزان', 7),
(664, 'سیاه گل', 7),
(665, 'شباب', 7),
(666, 'شورابه ملک', 7),
(667, 'شهرک اسلامیه', 7),
(668, 'شهرک سرتنگ', 7),
(669, 'شهرک ولیعصر', 7),
(670, 'صالح آباد', 7),
(671, 'علی اباد-ایلام', 7),
(672, 'عین خوش', 7),
(673, 'کلان', 7),
(674, 'گنداب', 7),
(675, 'گولاب', 7),
(676, 'لومار', 7),
(677, 'ماژین', 7),
(678, 'مورموری', 7),
(679, 'موسیان', 7),
(680, 'مهر', 7),
(681, 'میمه', 7),
(682, 'هفت چشمه-ایلام', 7),
(683, 'بوشهر', 8),
(684, 'برازجان', 8),
(685, 'جم', 8),
(686, 'بندر کنگان', 8),
(687, 'بندر گناوه', 8),
(688, 'خورموج', 8),
(689, 'عسلویه', 8),
(690, 'بندر دیر', 8),
(691, 'آباد', 8),
(692, 'آبپخش', 8),
(693, 'آبدان', 8),
(694, 'اباد', 8),
(695, 'ابگرمک', 8),
(696, 'امام حسن', 8),
(697, 'انارستان', 8),
(698, 'اهرم', 8),
(699, 'بادوله', 8),
(700, 'بردخون', 8),
(701, 'بردستان', 8),
(702, 'بندر دیلم', 8),
(703, 'بندر ریگ', 8),
(704, 'بنک', 8),
(705, 'بنه گز', 8),
(706, 'بوشکان', 8),
(707, 'تنگ ارم', 8),
(708, 'چغادک', 8),
(709, 'چهارروستایی', 8),
(710, 'خارک', 8),
(711, 'دالکی', 8),
(712, 'دلوار', 8),
(713, 'دوراهک', 8),
(714, 'ریز', 8),
(715, 'سعد آباد', 8),
(716, 'سیراف', 8),
(717, 'شبانکاره', 8),
(718, 'شنبه', 8),
(719, 'شول', 8),
(720, 'عالیشهر', 8),
(721, 'کاکی', 8),
(722, 'کلمه', 8),
(723, 'نخل تقی', 8),
(724, 'وحدتیه', 8),
(725, 'تهران', 9),
(726, 'اسلامشهر', 9),
(727, 'شهریار', 9),
(728, 'اندیشه', 9),
(729, 'ملارد', 9),
(730, 'قدس', 9),
(731, 'پردیس', 9),
(732, 'پاکدشت', 9),
(733, 'آبعلی', 9),
(734, 'ابباریک', 9),
(735, 'ابراهیم اباد', 9),
(736, 'احمدآبادجانسپار', 9),
(737, 'احمدابادمستوفی', 9),
(738, 'ارجمند', 9),
(739, 'اسلام اباد', 9),
(740, 'اسماعیل آباد', 9),
(741, 'امیریه', 9),
(742, 'ایجدان', 9),
(743, 'باغخواص', 9),
(744, 'باغستان', 9),
(745, 'باقرشهر', 9),
(746, 'بومهن', 9),
(747, 'پارچین', 9),
(748, 'پرند', 9),
(749, 'پیشوا', 9),
(750, 'جابان', 9),
(751, 'جاجرود(خسروآباد)', 9),
(752, 'جعفرابادباقراف', 9),
(753, 'جلیل اباد', 9),
(754, 'جواد آباد', 9),
(755, 'چرمشهر', 9),
(756, 'چهاردانگه', 9),
(757, 'حسن آباد', 9),
(758, 'حسن آباد فشافویه', 9),
(759, 'حصارامیر', 9),
(760, 'حصاربن', 9),
(761, 'حصارک بالا', 9),
(762, 'حصارک پایین', 9),
(763, 'خاتون اباد', 9),
(764, 'خاورشهر', 9),
(765, 'خاوه', 9),
(766, 'خلازیر', 9),
(767, 'داوداباد', 9),
(768, 'درده', 9),
(769, 'دماوند', 9),
(770, 'دهماسین', 9),
(771, 'رباط کریم', 9),
(772, 'رودهن', 9),
(773, 'سبزدشت', 9),
(774, 'سربندان', 9),
(775, 'سعیدآباد', 9),
(776, 'سلطان اباد', 9),
(777, 'سه راه سنگی', 9),
(778, 'شاطره', 9),
(779, 'شاهدشهر', 9),
(780, 'شریف آباد', 9),
(781, 'شمس اباد', 9),
(782, 'شمشک', 9),
(783, 'شهر جدید پرند', 9),
(784, 'شهر صنعتی پرند', 9),
(785, 'شهر قدس', 9),
(786, 'شهرصنعتی خرمدشت', 9),
(787, 'شهرک صنعتی چهاردانگه', 9),
(788, 'شهرک صنعتی خاوران', 9),
(789, 'شهرک صنعتی گلگون', 9),
(790, 'شهرک صنعتی نصیرشهر', 9),
(791, 'شهرک عباس آباد', 9),
(792, 'شهرک قلعه میر', 9),
(793, 'صالح آباد', 9),
(794, 'صالحیه', 9),
(795, 'صبا شهر', 9),
(796, 'صفادشت', 9),
(797, 'طورقوزاباد', 9),
(798, 'عباس آباد علاقبند', 9),
(799, 'عسگرابادعباسی', 9),
(800, 'فردوسیه', 9),
(801, 'فرودگاه امام خمینی', 9),
(802, 'فرون آباد', 9),
(803, 'فرون اباد', 9),
(804, 'فشم', 9),
(805, 'فیروزبهرام', 9),
(806, 'فیروزکوه', 9),
(807, 'قاسم ابادشوراباد', 9),
(808, 'قرچک', 9),
(809, 'قلعه خواجه', 9),
(810, 'قلعه سین', 9),
(811, 'قلعه محمدعلی خان', 9),
(812, 'قلعه نوخالصه', 9),
(813, 'قمصر', 9),
(814, 'قو,چ حصار', 9),
(815, 'قیام دشت', 9),
(816, 'قیامدشت', 9),
(817, 'کریم اباد', 9),
(818, 'کلمه', 9),
(819, 'کهریزک', 9),
(820, 'کیلان', 9),
(821, 'گردنه تنباکویی', 9),
(822, 'گرمدره', 9),
(823, 'گل تپه کبیر', 9),
(824, 'گلدسته', 9),
(825, 'گلستان', 9),
(826, 'لپه زنگ', 9),
(827, 'لم اباد', 9),
(828, 'لواسان بزرگ', 9),
(829, 'لواسان کوچک', 9),
(830, 'محمودابادپیرزاده', 9),
(831, 'مرا', 9),
(832, 'مرقدامام ره', 9),
(833, 'مشا', 9),
(834, 'مهرآباد', 9),
(835, 'نسیم شهر', 9),
(836, 'نصیرآباد', 9),
(837, 'نصیرشهر', 9),
(838, 'وحیدیه', 9),
(839, 'ورامین', 9),
(840, 'وهن اباد', 9),
(841, 'هرانده', 9),
(842, 'شهرکرد', 10),
(843, 'بروجن', 10),
(844, 'لردگان', 10),
(845, 'فرخ شهر', 10),
(846, 'فارسان', 10),
(847, 'سامان', 10),
(848, 'هفشجان', 10),
(849, 'فرادنبه', 10),
(850, 'آلونی', 10),
(851, 'اردل', 10),
(852, 'امام قیس', 10),
(853, 'اورگان-چهارمحال و بختیاری', 10),
(854, 'باباحیدر', 10),
(855, 'بازفت', 10),
(856, 'بلداجی', 10),
(857, 'بن', 10),
(858, 'پردنجان', 10),
(859, 'جونقان', 10),
(860, 'چلگرد', 10),
(861, 'چلیچه', 10),
(862, 'چمن بید', 10),
(863, 'چوله دان', 10),
(864, 'خراجی', 10),
(865, 'دزک', 10),
(866, 'دستناء', 10),
(867, 'دشتک', 10),
(868, 'سرخون', 10),
(869, 'سردشت لردگان', 10),
(870, 'سردشت-چهارمحال و بختیاری', 10),
(871, 'سفید دشت', 10),
(872, 'سودجان', 10),
(873, 'سورشجان', 10),
(874, 'شلمزار', 10),
(875, 'شهریاری', 10),
(876, 'صمصامی', 10),
(877, 'طاقانک', 10),
(878, 'کاج', 10),
(879, 'کیان', 10),
(880, 'گل سفید', 10),
(881, 'گندمان', 10),
(882, 'گوجان', 10),
(883, 'گهرو', 10),
(884, 'مال خلیفه', 10),
(885, 'مرغملک', 10),
(886, 'منج', 10),
(887, 'ناغان', 10),
(888, 'نافچ', 10),
(889, 'نقنه', 10),
(890, 'وردنجان', 10),
(891, 'هارونی', 10),
(892, 'بیرجند', 11),
(893, 'طبس', 11),
(894, 'قائن', 11),
(895, 'فردوس', 11),
(896, 'نهبندان', 11),
(897, 'بشرویه', 11),
(898, 'سرایان', 11),
(899, 'سربیشه', 11),
(900, 'آرین شهر', 11),
(901, 'آیسک', 11),
(902, 'ارسک', 11),
(903, 'اسدیه', 11),
(904, 'اسفدن', 11),
(905, 'اسلامیه', 11),
(906, 'بیهود', 11),
(907, 'حاجی آباد', 11),
(908, 'خضری دشت بیاض', 11),
(909, 'خوسف', 11),
(910, 'دیهوک', 11),
(911, 'زهان', 11),
(912, 'سه قلعه', 11),
(913, 'شوسف', 11),
(914, 'طبس مسینا', 11),
(915, 'عشق آباد', 11),
(916, 'قاین', 11),
(917, 'قهستان', 11),
(918, 'گزو', 11),
(919, 'گزیک', 11),
(920, 'محمدشهر', 11),
(921, 'مود', 11),
(922, 'نیمبلوک', 11),
(923, 'مشهد', 12),
(924, 'نیشابور', 12),
(925, 'سبزوار', 12),
(926, 'تربت حیدریه', 12),
(927, 'قوچان', 12),
(928, 'کاشمر', 12),
(929, 'گناباد', 12),
(930, 'تربت جام', 12),
(931, 'ابدال اباد', 12),
(932, 'احمدآباد صولت', 12),
(933, 'ارداک', 12),
(934, 'ازادوار', 12),
(935, 'ازاده', 12),
(936, 'اسحق اباد-خراسان رضوی', 12),
(937, 'اسداباد-خراسان رضوی', 12),
(938, 'امامقلی', 12),
(939, 'انابد', 12),
(940, 'انداده', 12),
(941, 'اوندر', 12),
(942, 'باجگیران', 12),
(943, 'باخرز', 12),
(944, 'بار', 12),
(945, 'باسفر', 12),
(946, 'بایک', 12),
(947, 'بجستان', 12),
(948, 'بردسکن', 12),
(949, 'برزنون', 12),
(950, 'برغمد', 12),
(951, 'بزنگان', 12),
(952, 'بقمج', 12),
(953, 'بلاشی اباد', 12),
(954, 'بندقرا', 12),
(955, 'بنی تاک', 12),
(956, 'بیدخت', 12),
(957, 'پس کمر', 12),
(958, 'تایباد', 12),
(959, 'تقی اباد-خراسان رضوی', 12),
(960, 'تندک', 12),
(961, 'جزین', 12),
(962, 'جغتای', 12),
(963, 'جنت اباد-خراسان رضوی', 12),
(964, 'جنگل', 12),
(965, 'جوزان-خراسان رضوی', 12),
(966, 'چاپشلو', 12),
(967, 'چاهک', 12),
(968, 'چخماق', 12),
(969, 'چشمه گل', 12),
(970, 'چکنه', 12),
(971, 'چمن اباد', 12),
(972, 'چناران', 12),
(973, 'حسن اباد-خراسان رضوی', 12),
(974, 'حسن ابادلایین نو', 12),
(975, 'حکم اباد', 12),
(976, 'خرو', 12),
(977, 'خلیل آباد', 12),
(978, 'خواف', 12),
(979, 'خوجان', 12),
(980, 'داورزن', 12),
(981, 'درزاب', 12),
(982, 'درگز', 12),
(983, 'درود', 12),
(984, 'درونه', 12),
(985, 'دستوران', 12),
(986, 'دوغایی', 12),
(987, 'دوقارون', 12),
(988, 'دولت آباد', 12),
(989, 'دهنو-خراسان رضوی', 12),
(990, 'دیزادیز', 12),
(991, 'رادکان', 12),
(992, 'راه چمن', 12),
(993, 'رباط سنگ', 12),
(994, 'رباطجز', 12),
(995, 'رباطسرپوشی', 12),
(996, 'رشتخوار', 12),
(997, 'رضویه', 12),
(998, 'رکن اباد', 12),
(999, 'روداب', 12),
(1000, 'رودخانه', 12),
(1001, 'رویینی', 12),
(1002, 'ریوش', 12),
(1003, 'زرغری', 12),
(1004, 'زرکک', 12),
(1005, 'زیبد', 12),
(1006, 'سرخس', 12),
(1007, 'سفید سنگ', 12),
(1008, 'سلامی', 12),
(1009, 'سلطان آباد', 12),
(1010, 'سلوگرد', 12),
(1011, 'سنگ بست', 12),
(1012, 'سنگان', 12),
(1013, 'سیداباد-خراسان رضوی', 12),
(1014, 'سیوکی', 12),
(1015, 'شادمهر', 12),
(1016, 'شامکان', 12),
(1017, 'شاندیز', 12),
(1018, 'ششتمد', 12),
(1019, 'شفیع', 12),
(1020, 'شفیع اباد', 12),
(1021, 'شوراب', 12),
(1022, 'شهر زو', 12),
(1023, 'شهرآباد', 12),
(1024, 'شهرک زیندانلو', 12),
(1025, 'شهرکهنه', 12),
(1026, 'شیرتپه', 12),
(1027, 'صالح آباد', 12),
(1028, 'طرقبه', 12),
(1029, 'طوس سفلی', 12),
(1030, 'عبدل اباد', 12),
(1031, 'عشق آباد', 12),
(1032, 'فدافن', 12),
(1033, 'فدیشه', 12),
(1034, 'فرخک', 12),
(1035, 'فرهاد گرد', 12),
(1036, 'فریمان', 12),
(1037, 'فیروزه', 12),
(1038, 'فیض آباد', 12),
(1039, 'قاسم آباد', 12),
(1040, 'قدمگاه', 12),
(1041, 'قرقی سفلی (شهیدکاوه )', 12),
(1042, 'قریه شرف', 12),
(1043, 'قلعه اقاحسن', 12),
(1044, 'قلعه نو-خراسان رضوی', 12),
(1045, 'قلندر آباد', 12),
(1046, 'کاخک', 12),
(1047, 'کاریز', 12),
(1048, 'کاریزنو', 12),
(1049, 'کاسف', 12),
(1050, 'کامه سفلی', 12),
(1051, 'کبودان', 12),
(1052, 'کپکان', 12),
(1053, 'کته شمشیرسفلی', 12),
(1054, 'کچولی', 12),
(1055, 'کدکن', 12),
(1056, 'کرات', 12),
(1057, 'کلات', 12),
(1058, 'کندر', 12),
(1059, 'کندک لی', 12),
(1060, 'کنه بیست', 12),
(1061, 'کورده', 12),
(1062, 'کوه سفید', 12),
(1063, 'گلبوی پایین', 12),
(1064, 'گلبهار', 12),
(1065, 'گلمکان', 12),
(1066, 'گنبدلی', 12),
(1067, 'گوش', 12),
(1068, 'گیسوربالا', 12),
(1069, 'لطف آباد', 12),
(1070, 'مبارکه-خراسان رضوی', 12),
(1071, 'محمدتقی', 12),
(1072, 'محموداباد-خراسان رضوی', 12),
(1073, 'مزدآوند', 12),
(1074, 'مزینان', 12),
(1075, 'مژن اباد', 12),
(1076, 'مشکان-خراسان رضوی', 12),
(1077, 'مشهدریزه', 12),
(1078, 'ملک آباد', 12),
(1079, 'موسی اباد-خراسان رضوی', 12),
(1080, 'مهر-خراسان رضوی', 12),
(1081, 'مهنه', 12),
(1082, 'میامی-خراسان رضوی', 12),
(1083, 'میراباد-خراسان رضوی', 12),
(1084, 'نامن', 12),
(1085, 'نریمانی سفلی', 12),
(1086, 'نشتیفان', 12),
(1087, 'نصر', 12),
(1088, 'نصرآباد', 12),
(1089, 'نقاب', 12),
(1090, 'نوخندان', 12),
(1091, 'نوده انقلاب', 12),
(1092, 'نیل شهر', 12),
(1093, 'همت آباد', 12),
(1094, 'یاقوتین جدید', 12),
(1095, 'یدک', 12),
(1096, 'یک لنگی علیا', 12),
(1097, 'یونسی', 12),
(1098, 'بجنورد', 13),
(1099, 'شیروان', 13),
(1100, 'اسفراین', 13),
(1101, 'جاجرم', 13),
(1102, 'آشخانه', 13),
(1103, 'گرمه', 13),
(1104, 'فاروج', 13),
(1105, 'درق', 13),
(1106, 'آوا', 13),
(1107, 'ایور', 13),
(1108, 'پیش قلعه', 13),
(1109, 'تیتکانلو', 13),
(1110, 'چناران شهر', 13),
(1111, 'حصارگرمخان', 13),
(1112, 'خرق', 13),
(1113, 'دوین', 13),
(1114, 'راز', 13),
(1115, 'رباط-خراسان شمالی', 13),
(1116, 'رزق اباد', 13),
(1117, 'زیارت', 13),
(1118, 'سنخواست', 13),
(1119, 'شوقان', 13),
(1120, 'صفی آباد', 13),
(1121, 'قاضی', 13),
(1122, 'قوشخانه', 13),
(1123, 'لوجلی', 13),
(1124, 'اهواز', 14),
(1125, 'بندر ماهشهر', 14),
(1126, 'دزفول', 14),
(1127, 'آبادان', 14),
(1128, 'بهبهان', 14),
(1129, 'اندیمشک', 14),
(1130, 'خرمشهر', 14),
(1131, 'شوشتر', 14),
(1132, 'آبژدان', 14),
(1133, 'آزادی', 14),
(1134, 'آغاجاری', 14),
(1135, 'ابوحمیظه', 14),
(1136, 'اروند کنار', 14),
(1137, 'اسیاب', 14),
(1138, 'الوان', 14),
(1139, 'الهائی', 14),
(1140, 'الهایی', 14),
(1141, 'ام الطمیر (سیدیوسف )', 14),
(1142, 'امام', 14),
(1143, 'امیدیه', 14),
(1144, 'ایذه', 14),
(1145, 'باغ ملک', 14),
(1146, 'بروایه یوسف', 14),
(1147, 'بستان', 14),
(1148, 'بندر امام خمینی', 14),
(1149, 'بوزی سیف', 14),
(1150, 'بیدروبه', 14),
(1151, 'پشت پیان', 14),
(1152, 'ترکالکی', 14),
(1153, 'تشان', 14),
(1154, 'تله زنگ پایین', 14),
(1155, 'تنگ یک', 14),
(1156, 'جایزان', 14),
(1157, 'جنت مکان', 14),
(1158, 'چغامیش', 14),
(1159, 'چلون', 14),
(1160, 'چم کلگه', 14),
(1161, 'چم گلک', 14),
(1162, 'چمران', 14),
(1163, 'چنارستان', 14),
(1164, 'چوئبده', 14),
(1165, 'حر', 14),
(1166, 'حسینیه', 14),
(1167, 'حفاری شرقی', 14),
(1168, 'حمزه', 14),
(1169, 'حمیدیه', 14),
(1170, 'خسرجی راضی حمد', 14),
(1171, 'خنافره', 14),
(1172, 'خواجوی', 14),
(1173, 'دارخوین', 14),
(1174, 'درویشی', 14),
(1175, 'دره بوری', 14),
(1176, 'دره تونم نمی', 14),
(1177, 'دهدز', 14),
(1178, 'رامشیر', 14),
(1179, 'رامهرمز', 14),
(1180, 'رفیع', 14),
(1181, 'رودزرد', 14),
(1182, 'روستای عنبر', 14),
(1183, 'زهره', 14),
(1184, 'سالند', 14),
(1185, 'سرداران', 14),
(1186, 'سردشت', 14),
(1187, 'سماله', 14),
(1188, 'سوسنگرد', 14),
(1189, 'سیاه منصور', 14),
(1190, 'سیدعباس', 14),
(1191, 'شادگان', 14),
(1192, 'شاوور', 14),
(1193, 'شاه غالب ده ابراهیم', 14),
(1194, 'شرافت', 14),
(1195, 'شمس آباد', 14),
(1196, 'شوش', 14),
(1197, 'شهر امام', 14),
(1198, 'شهرک انصار', 14),
(1199, 'شهرک بهرام', 14),
(1200, 'شهرک نورمحمدی', 14),
(1201, 'شیبان', 14),
(1202, 'صالح شهر', 14),
(1203, 'صفی آباد', 14),
(1204, 'صیدون', 14),
(1205, 'عبودی', 14),
(1206, 'عرب حسن', 14),
(1207, 'علمه تیمورابوذرغفاری', 14),
(1208, 'عین دو', 14),
(1209, 'غیزانیه بزرگ', 14),
(1210, 'فتح المبین', 14),
(1211, 'فیاضی', 14),
(1212, 'قلعه تل', 14),
(1213, 'قلعه چنعان', 14),
(1214, 'قلعه خواجه', 14),
(1215, 'کردستان بزرگ', 14),
(1216, 'کریت برومی', 14),
(1217, 'کلگه دره دو', 14),
(1218, 'کوت سیدنعیم', 14),
(1219, 'کوت عبدالله', 14),
(1220, 'کوشکک-خوزستان', 14),
(1221, 'گاومیش اباد', 14),
(1222, 'گتوند', 14),
(1223, 'گروه پدافندهوایی بهبها', 14),
(1224, 'گلگیر', 14),
(1225, 'گوریه', 14),
(1226, 'لالی', 14),
(1227, 'مزرعه یک', 14),
(1228, 'مسجد سلیمان', 14),
(1229, 'مشراگه', 14),
(1230, 'مقاومت', 14),
(1231, 'ملاثانی', 14),
(1232, 'منصوریه', 14),
(1233, 'میانرود', 14),
(1234, 'میانکوه', 14),
(1235, 'میداود', 14),
(1236, 'مینوشهر', 14),
(1237, 'نفت سفید', 14),
(1238, 'نهرابطر', 14),
(1239, 'نهرسلیم', 14),
(1240, 'ویس', 14),
(1241, 'هفتگل', 14),
(1242, 'هندیجان', 14),
(1243, 'هویزه', 14),
(1244, 'یزدنو', 14),
(1245, 'زنجان', 15),
(1246, 'ابهر', 15),
(1247, 'خرمدره', 15),
(1248, 'قیدار', 15),
(1249, 'سلطانیه', 15),
(1250, 'آب بر', 15),
(1251, 'ماه نشان', 15),
(1252, 'صائین قلعه', 15),
(1253, 'ارمخانخانه', 15),
(1254, 'ارمغانخانه', 15),
(1255, 'اژدهاتو', 15),
(1256, 'اسفجین', 15),
(1257, 'اقبلاغ سفلی', 15),
(1258, 'اندابادعلیا', 15),
(1259, 'باش قشلاق', 15),
(1260, 'بوغداکندی', 15),
(1261, 'پری', 15),
(1262, 'چورزق', 15),
(1263, 'حلب', 15),
(1264, 'درام', 15),
(1265, 'درسجین', 15),
(1266, 'دستجرده', 15),
(1267, 'دندی', 15),
(1268, 'دولت اباد-زنجان', 15),
(1269, 'زرین آباد', 15),
(1270, 'زرین رود', 15),
(1271, 'سجاس', 15),
(1272, 'سعیداباد-زنجان', 15),
(1273, 'سنبل اباد', 15),
(1274, 'سونتو', 15),
(1275, 'سهرورد', 15),
(1276, 'قبله بلاغی', 15),
(1277, 'قره گل', 15),
(1278, 'قلتوق', 15),
(1279, 'کرسف', 15),
(1280, 'کهلا', 15),
(1281, 'کینه ورس', 15),
(1282, 'گرماب', 15),
(1283, 'گوزلدره', 15),
(1284, 'گیلوان', 15),
(1285, 'محموداباد-زنجان', 15),
(1286, 'نوربهار', 15),
(1287, 'نیک پی', 15),
(1288, 'همایون', 15),
(1289, 'هیدج', 15),
(1290, 'سمنان', 16),
(1291, 'شاهرود', 16),
(1292, 'دامغان', 16),
(1293, 'گرمسار', 16),
(1294, 'مهدی شهر', 16),
(1295, 'ایوانکی', 16),
(1296, 'شهمیرزاد', 16),
(1297, 'سرخه', 16),
(1298, 'آرادان', 16),
(1299, 'ابخوری', 16),
(1300, 'ابراهیم اباد-سمنان', 16),
(1301, 'ابرسیج', 16),
(1302, 'ابگرم-سمنان', 16),
(1303, 'احمداباد', 16),
(1304, 'استانه', 16),
(1305, 'اسداباد-سمنان', 16),
(1306, 'افتر', 16),
(1307, 'امیریه', 16),
(1308, 'اهوان', 16),
(1309, 'ایستگاه میان دره', 16),
(1310, 'بدشت', 16),
(1311, 'برم', 16),
(1312, 'بسطام', 16),
(1313, 'بکران', 16),
(1314, 'بن کوه', 16),
(1315, 'بیابانک', 16),
(1316, 'بیارجمند', 16),
(1317, 'جام', 16),
(1318, 'جزن', 16),
(1319, 'جودانه', 16),
(1320, 'چاشم', 16),
(1321, 'چهلدخترپادگان', 16),
(1322, 'حسین ابادکوروس', 16),
(1323, 'خیراباد-سمنان', 16),
(1324, 'داوراباد', 16),
(1325, 'دربند', 16),
(1326, 'درجزین', 16),
(1327, 'دروار', 16),
(1328, 'دستجرد-سمنان', 16),
(1329, 'دوزهیر', 16),
(1330, 'ده صوفیان', 16),
(1331, 'دهملا', 16),
(1332, 'دیباج', 16),
(1333, 'رودیان', 16),
(1334, 'رویان-سمنان', 16),
(1335, 'زمان اباد', 16),
(1336, 'سطوه', 16),
(1337, 'سلمرود', 16),
(1338, 'سوداغلان', 16),
(1339, 'سیداباد-سمنان', 16),
(1340, 'طرزه', 16),
(1341, 'طرود', 16),
(1342, 'عبدالله ابادپایین', 16),
(1343, 'علا', 16),
(1344, 'علیان', 16),
(1345, 'عمروان', 16),
(1346, 'فرات', 16),
(1347, 'فرومد', 16),
(1348, 'فولادمحله', 16),
(1349, 'قدرت اباد', 16),
(1350, 'قلعه نوخرقان', 16),
(1351, 'قوشه', 16),
(1352, 'کرداباد', 16),
(1353, 'کردوان', 16),
(1354, 'کرک', 16),
(1355, 'کلاته', 16),
(1356, 'کلاته خیج', 16),
(1357, 'کلاته ملا', 16),
(1358, 'کهن آباد', 16),
(1359, 'گل رودبار', 16),
(1360, 'گلستانک', 16),
(1361, 'گیور', 16),
(1362, 'لاسجرد', 16),
(1363, 'لجران', 16),
(1364, 'مجن', 16),
(1365, 'محمداباد', 16),
(1366, 'مسیح اباد', 16),
(1367, 'معدن نمک', 16),
(1368, 'معصوم اباد', 16),
(1369, 'مغان', 16),
(1370, 'مندولک', 16),
(1371, 'مومن اباد-سمنان', 16),
(1372, 'مهماندوست', 16),
(1373, 'میامی', 16),
(1374, 'میغان', 16),
(1375, 'نردین', 16),
(1376, 'نظامی', 16),
(1377, 'نگارمن', 16),
(1378, 'هیکو', 16),
(1379, 'زاهدان', 17),
(1380, 'زابل', 17),
(1381, 'ایرانشهر', 17),
(1382, 'سراوان', 17),
(1383, 'چاه بهار', 17),
(1384, 'نیک شهر', 17),
(1385, 'خاش', 17),
(1386, 'چابهار', 17),
(1387, 'ادیمی', 17),
(1388, 'اسپکه', 17),
(1389, 'اسفندک', 17),
(1390, 'اسماعیل کلگ', 17),
(1391, 'افضل اباد', 17),
(1392, 'انده قدیم', 17),
(1393, 'ایرافشان', 17),
(1394, 'بالاقلعه', 17),
(1395, 'باهوکلات', 17),
(1396, 'برجمیرگل', 17),
(1397, 'بزمان', 17),
(1398, 'بمپور', 17),
(1399, 'بنت', 17),
(1400, 'بنجار', 17),
(1401, 'بیت اباد', 17),
(1402, 'پارود', 17),
(1403, 'پسابندر', 17),
(1404, 'پسکوه', 17),
(1405, 'پلان', 17),
(1406, 'پیپ', 17),
(1407, 'پیرسهراب', 17),
(1408, 'پیشین', 17),
(1409, 'تخت عدالت', 17),
(1410, 'تلنگ', 17),
(1411, 'تیموراباد', 17),
(1412, 'جالق', 17),
(1413, 'جزینک', 17),
(1414, 'جهان ابادعلیا', 17),
(1415, 'چانف', 17),
(1416, 'چاهان', 17),
(1417, 'حرمک', 17),
(1418, 'خمک', 17),
(1419, 'خواجه احمد', 17),
(1420, 'دستگرد-سیستان و بلوچستان', 17),
(1421, 'دوست محمد', 17),
(1422, 'دولت اباد-سیستان و بلوچستان', 17),
(1423, 'ده پابید', 17),
(1424, 'راسک', 17),
(1425, 'زرآباد', 17),
(1426, 'زراباد', 17),
(1427, 'زهک', 17),
(1428, 'زیرکدان', 17),
(1429, 'ژاله ای', 17),
(1430, 'ساربوک', 17),
(1431, 'سرباز', 17),
(1432, 'سرداب', 17),
(1433, 'سردک', 17),
(1434, 'سکوهه', 17),
(1435, 'سنگان-سیستان و بلوچستان', 17),
(1436, 'سوران', 17),
(1437, 'سیادک', 17),
(1438, 'سیرکان', 17),
(1439, 'شگیم بالا', 17),
(1440, 'شهدادکهیر', 17),
(1441, 'شهرک محمدشاه کرم', 17),
(1442, 'طیس', 17),
(1443, 'علی اکبر', 17),
(1444, 'فنوج', 17),
(1445, 'قصر قند', 17),
(1446, 'قلعه نو-سیستان و بلوچستان', 17),
(1447, 'کارواندر', 17),
(1448, 'کتیج', 17),
(1449, 'کرباسک', 17),
(1450, 'کشیک', 17),
(1451, 'کنارک', 17),
(1452, 'کوشکوک', 17),
(1453, 'کوشه', 17),
(1454, 'کوهک', 17),
(1455, 'گشت', 17),
(1456, 'گلمورتی', 17),
(1457, 'گلوگاه-سیستان و بلوچستان', 17),
(1458, 'گمن', 17),
(1459, 'گوهرکوه', 17),
(1460, 'لادیزعلیا', 17),
(1461, 'لوتک', 17),
(1462, 'محمد آباد', 17),
(1463, 'محمدان', 17),
(1464, 'محمدی', 17),
(1465, 'محنت', 17),
(1466, 'مسکوتان', 17),
(1467, 'مهرستان', 17),
(1468, 'میرجاوه', 17),
(1469, 'نازیل', 17),
(1470, 'ناصراباد-سیستان و بلوچستان', 17),
(1471, 'نصرت آباد', 17),
(1472, 'نگور', 17),
(1473, 'نوراباد', 17),
(1474, 'نوک آباد', 17),
(1475, 'نوک اباد', 17),
(1476, 'هودیان', 17),
(1477, 'هیچان', 17),
(1478, 'هیدوچ', 17),
(1479, 'هیرمند', 17),
(1480, 'شیراز', 18),
(1481, 'شهر جدید صدرا', 18),
(1482, 'مرودشت', 18),
(1483, 'جهرم', 18),
(1484, 'کازرون', 18),
(1485, 'فسا', 18),
(1486, 'داراب', 18),
(1487, 'لار', 18),
(1488, 'آباده', 18),
(1489, 'آباده طشک', 18),
(1490, 'اردکان', 18),
(1491, 'ارسنجان', 18),
(1492, 'اسپاس', 18),
(1493, 'استهبان', 18),
(1494, 'اسیر', 18),
(1495, 'اشکنان', 18),
(1496, 'افزر', 18),
(1497, 'اقلید', 18),
(1498, 'اکبراباد', 18),
(1499, 'امام شهر', 18),
(1500, 'امامزاده اسماعیل', 18),
(1501, 'انارستان-فارس', 18),
(1502, 'اوز', 18),
(1503, 'اهل', 18),
(1504, 'اهنگری', 18),
(1505, 'ایج', 18),
(1506, 'ایزد خواست', 18),
(1507, 'باب انار', 18),
(1508, 'بابامنیر', 18),
(1509, 'بالاده', 18),
(1510, 'بانش', 18),
(1511, 'بایگان', 18),
(1512, 'بنارویه', 18),
(1513, 'بندامیر', 18),
(1514, 'بندبست', 18),
(1515, 'بنوان', 18),
(1516, 'بوانات', 18),
(1517, 'به جان', 18),
(1518, 'بهرغان', 18),
(1519, 'بهمن', 18),
(1520, 'بیرم', 18),
(1521, 'بیضا', 18),
(1522, 'پاسگاه چنارراهدار', 18),
(1523, 'پرین', 18),
(1524, 'تفیهان', 18),
(1525, 'جره', 18),
(1526, 'جنت شهر', 18),
(1527, 'جوکان', 18),
(1528, 'جویم', 18),
(1529, 'چمن مروارید', 18),
(1530, 'حاجی آباد', 18),
(1531, 'حسامی', 18),
(1532, 'حسن آباد', 18),
(1533, 'حسین ابادرستم', 18),
(1534, 'حکیم باشی نصف میان (بالا)', 18),
(1535, 'خانه زنیان', 18),
(1536, 'خانیمن', 18),
(1537, 'خاوران', 18),
(1538, 'خرامه', 18),
(1539, 'خشت', 18),
(1540, 'خنج', 18),
(1541, 'خنجشت', 18),
(1542, 'خور', 18),
(1543, 'خوزی', 18),
(1544, 'خومه زار', 18),
(1545, 'خیرابادتوللی', 18),
(1546, 'داریان', 18),
(1547, 'دبیران', 18),
(1548, 'درب قلعه', 18),
(1549, 'دژکرد', 18),
(1550, 'دنیان', 18),
(1551, 'دوبرجی', 18),
(1552, 'دوزه', 18),
(1553, 'دهرم', 18),
(1554, 'دهفیش', 18),
(1555, 'راشک علیا', 18),
(1556, 'رامجرد', 18),
(1557, 'رستاق', 18),
(1558, 'رونیز', 18),
(1559, 'زاهد شهر', 18),
(1560, 'زرقان', 18),
(1561, 'سده', 18),
(1562, 'سروستان', 18),
(1563, 'سروو', 18),
(1564, 'سعادت شهر', 18),
(1565, 'سلطان آباد-فارس', 18),
(1566, 'سلطان شهر', 18),
(1567, 'سورمق', 18),
(1568, 'سیدان', 18),
(1569, 'ششده', 18),
(1570, 'شوریجه', 18),
(1571, 'شهر پیر', 18),
(1572, 'شهرمیان', 18),
(1573, 'صحرارود', 18),
(1574, 'صغاد', 18),
(1575, 'صفا شهر', 18),
(1576, 'طسوج', 18),
(1577, 'علامرودشت', 18),
(1578, 'عماد ده', 18),
(1579, 'فتح اباد-فارس', 18),
(1580, 'فدامی', 18),
(1581, 'فراشبند', 18),
(1582, 'فیروزآباد', 18),
(1583, 'فیشور', 18),
(1584, 'قائمیه', 18),
(1585, 'قادرآباد', 18),
(1586, 'قاسم ابادسفلی', 18),
(1587, 'قره بلاغ', 18),
(1588, 'قطاربنه', 18),
(1589, 'قطب آباد', 18),
(1590, 'قطرویه', 18),
(1591, 'قیر', 18),
(1592, 'کارزین', 18),
(1593, 'کامفیروز', 18),
(1594, 'کره ای', 18),
(1595, 'کلاتون', 18),
(1596, 'کلانی', 18),
(1597, 'کم جان', 18),
(1598, 'کمارج مرکزی', 18),
(1599, 'کمهر', 18),
(1600, 'کنار تخته', 18),
(1601, 'کوار', 18),
(1602, 'کوپن', 18),
(1603, 'کوشک بیدک', 18),
(1604, 'کوشک قاضی', 18),
(1605, 'کوشک-فارس', 18),
(1606, 'کوشکک-فارس', 18),
(1607, 'کوهنجان', 18),
(1608, 'کهنه', 18),
(1609, 'گراش', 18),
(1610, 'گله دار', 18),
(1611, 'گویم', 18),
(1612, 'لامرد', 18),
(1613, 'لای حنا', 18),
(1614, 'لپوئی', 18),
(1615, 'لطیفی', 18),
(1616, 'مادرسلیمان', 18),
(1617, 'مادوان-فارس', 18),
(1618, 'مانیان', 18),
(1619, 'ماه سالاری', 18),
(1620, 'مبارک آباد', 18),
(1621, 'مزایجان', 18),
(1622, 'مشکان', 18),
(1623, 'مصیری', 18),
(1624, 'مظفری', 18),
(1625, 'موردراز', 18),
(1626, 'مهارلو', 18),
(1627, 'مهبودی علیا', 18),
(1628, 'مهر', 18),
(1629, 'مهرنجان', 18),
(1630, 'میانده-فارس', 18),
(1631, 'میانشهر', 18),
(1632, 'میشان سفلی', 18),
(1633, 'میمند', 18),
(1634, 'نوبندگان', 18),
(1635, 'نوجین', 18),
(1636, 'نودان', 18),
(1637, 'نورآباد', 18),
(1638, 'نی ریز', 18),
(1639, 'وراوی', 18),
(1640, 'هرایجان', 18),
(1641, 'هرگان', 18),
(1642, 'هماشهر', 18),
(1643, 'قزوین', 19),
(1644, 'محمدیه', 19),
(1645, 'الوند', 19),
(1646, 'آبیک', 19),
(1647, 'تاکستان', 19),
(1648, 'بوئین زهرا', 19),
(1649, 'مهرگان', 19),
(1650, 'بیدستان', 19),
(1651, 'آبگرم', 19),
(1652, 'آوج', 19),
(1653, 'ارداق', 19),
(1654, 'استبلخ', 19),
(1655, 'اسفرورین', 19),
(1656, 'اقابابا', 19),
(1657, 'اقبالیه', 19),
(1658, 'الولک', 19),
(1659, 'حسین اباد-قزوین', 19),
(1660, 'حصارولیعصر', 19),
(1661, 'خاکعلی', 19),
(1662, 'خرم اباد', 19),
(1663, 'خرمدشت', 19),
(1664, 'دانسفهان', 19),
(1665, 'رازمیان', 19),
(1666, 'رحیم اباد', 19),
(1667, 'رشتقون', 19),
(1668, 'زوارک', 19),
(1669, 'سگز آباد', 19),
(1670, 'سیاهپوش', 19),
(1671, 'سیردان', 19),
(1672, 'شال', 19),
(1673, 'شریفیه', 19),
(1674, 'شهرک صنعتی لیا (قدیم )', 19),
(1675, 'صمغ اباد', 19),
(1676, 'ضیاء آباد', 19),
(1677, 'عصمت اباد', 19),
(1678, 'فلار', 19),
(1679, 'قشلاق', 19),
(1680, 'کاکوهستان', 19),
(1681, 'کلنجین', 19),
(1682, 'کوهین', 19),
(1683, 'ماهین', 19),
(1684, 'محمود آباد نمونه', 19),
(1685, 'معلم کلایه', 19),
(1686, 'مینودشت', 19),
(1687, 'ناصراباد-قزوین', 19),
(1688, 'نرجه', 19),
(1689, 'نصرت آباد-قزوین', 19),
(1690, 'نیارج', 19),
(1691, 'نیارک', 19),
(1692, 'نیکویه', 19),
(1693, 'یحیی اباد-قزوین', 19),
(1694, 'قم', 20),
(1695, 'جعفریه', 20),
(1696, 'قنوات', 20),
(1697, 'کهک', 20),
(1698, 'سلفچگان', 20),
(1699, 'دستجرد', 20),
(1700, 'قاهان', 20),
(1701, 'قمرود', 20),
(1702, 'امیرابادگنجی', 20),
(1703, 'جنداب', 20),
(1704, 'قلعه چم', 20),
(1705, 'سنندج', 21),
(1706, 'قروه', 21),
(1707, 'سقز', 21),
(1708, 'مریوان', 21),
(1709, 'بیجار', 21),
(1710, 'بانه', 21),
(1711, 'کامیاران', 21),
(1712, 'دیواندره', 21),
(1713, 'آرمرده', 21),
(1714, 'اق بلاغ طغامین', 21),
(1715, 'اورامان تخت', 21),
(1716, 'بابارشانی', 21),
(1717, 'برده رشه', 21),
(1718, 'بلبان آباد', 21),
(1719, 'بوالحسن', 21),
(1720, 'بوئین سفلی', 21),
(1721, 'بیساران', 21),
(1722, 'پیرتاج', 21),
(1723, 'پیرخضران', 21),
(1724, 'توپ آغاج', 21),
(1725, 'توپ اغاج', 21),
(1726, 'تیلکو', 21),
(1727, 'جعفراباد-کردستان', 21),
(1728, 'چناره', 21),
(1729, 'خامسان', 21),
(1730, 'خرکه', 21),
(1731, 'خسرواباد-کردستان', 21),
(1732, 'خورخوره-کردستان', 21),
(1733, 'دزج', 21),
(1734, 'دلبران', 21),
(1735, 'دهگلان', 21),
(1736, 'زرینه', 21),
(1737, 'سرا', 21),
(1738, 'سرو آباد', 21),
(1739, 'سریش آباد', 21),
(1740, 'شاهینی', 21),
(1741, 'شریف اباد', 21),
(1742, 'شوی', 21),
(1743, 'شویشه', 21),
(1744, 'شیروانه', 21),
(1745, 'صاحب', 21),
(1746, 'طای', 21),
(1747, 'قوریچای', 21),
(1748, 'کانی دینار', 21),
(1749, 'کانی سور', 21),
(1750, 'کانی گنجی', 21),
(1751, 'کسنزان', 21),
(1752, 'کوخان', 21),
(1753, 'کوله', 21),
(1754, 'گازرخانی', 21),
(1755, 'گاوشله', 21),
(1756, 'گل تپه-کردستان', 21),
(1757, 'گورباباعلی', 21),
(1758, 'موچش', 21),
(1759, 'میرده', 21),
(1760, 'نشورسفلی', 21),
(1761, 'ننور', 21),
(1762, 'نی', 21),
(1763, 'هزارکانیان', 21),
(1764, 'یاسوکند', 21),
(1765, 'کرمان', 22),
(1766, 'سیرجان', 22),
(1767, 'رفسنجان', 22),
(1768, 'جیرفت', 22),
(1769, 'بم', 22),
(1770, 'زرند', 22),
(1771, 'شهر بابک', 22),
(1772, 'کهنوج', 22),
(1773, 'ابارق', 22),
(1774, 'اختیار آباد', 22),
(1775, 'ارزوئیه', 22),
(1776, 'امیراباد', 22),
(1777, 'امین شهر', 22),
(1778, 'انار', 22),
(1779, 'اندوهجرد', 22),
(1780, 'باغین', 22),
(1781, 'بافت', 22),
(1782, 'برج معاز', 22),
(1783, 'بردسیر', 22),
(1784, 'بروات', 22),
(1785, 'بزنجان', 22),
(1786, 'بلورد', 22),
(1787, 'بلوک', 22),
(1788, 'بهرمان', 22),
(1789, 'پاریز', 22),
(1790, 'پتکان', 22),
(1791, 'تهرود', 22),
(1792, 'جبالبارز', 22),
(1793, 'جرجافک', 22),
(1794, 'جوادیه الهیه نوق', 22),
(1795, 'جوپار', 22),
(1796, 'جور', 22),
(1797, 'جوزم', 22),
(1798, 'جوشان', 22),
(1799, 'چترود', 22),
(1800, 'چناربرین', 22),
(1801, 'حتکن', 22),
(1802, 'حرجند', 22),
(1803, 'حسین ابادجدید', 22),
(1804, 'خاتون آباد', 22),
(1805, 'خانوک', 22),
(1806, 'خانه خاتون', 22),
(1807, 'خبر', 22),
(1808, 'خنامان', 22),
(1809, 'خواجوشهر', 22),
(1810, 'خورسند', 22),
(1811, 'خیراباد-کرمان', 22),
(1812, 'داوران', 22),
(1813, 'درب بهشت', 22),
(1814, 'دریجان', 22),
(1815, 'دشت خاک', 22),
(1816, 'دشتکار', 22),
(1817, 'دوساری', 22),
(1818, 'ده بالا', 22),
(1819, 'دهج', 22),
(1820, 'رابر', 22),
(1821, 'راور', 22),
(1822, 'راین', 22),
(1823, 'رضی ابادبالا', 22),
(1824, 'رودبار', 22),
(1825, 'ریحان', 22),
(1826, 'زنگی آباد', 22),
(1827, 'زهکلوت', 22),
(1828, 'زید آباد', 22),
(1829, 'سرچشمه', 22),
(1830, 'سرخ قلعه', 22),
(1831, 'سیریز', 22),
(1832, 'شعبجره', 22),
(1833, 'شهداد', 22),
(1834, 'صفائیه', 22),
(1835, 'عماداباد', 22),
(1836, 'عنبر آباد', 22),
(1837, 'فاریاب', 22),
(1838, 'فهرج', 22),
(1839, 'فیض اباد', 22),
(1840, 'قلعه عسکر', 22),
(1841, 'قلعه گنج', 22),
(1842, 'کاظم آباد', 22),
(1843, 'کبوترخان', 22),
(1844, 'کشکوئیه', 22),
(1845, 'کشیت', 22),
(1846, 'کمال اباد', 22),
(1847, 'کمسرخ', 22),
(1848, 'کوهبنان', 22),
(1849, 'کیانشهر', 22),
(1850, 'گروه', 22),
(1851, 'گزک', 22),
(1852, 'گلباف', 22),
(1853, 'گلزار', 22),
(1854, 'گلشن-کرمان', 22),
(1855, 'گنبکی', 22),
(1856, 'لاله زار', 22),
(1857, 'ماهان', 22),
(1858, 'محمد آباد', 22),
(1859, 'محمدابادبرفه', 22),
(1860, 'محی آباد', 22),
(1861, 'مردهک', 22),
(1862, 'مس سرچشمه', 22),
(1863, 'ملک اباد', 22),
(1864, 'منوجان', 22),
(1865, 'مومن اباد-کرمان', 22),
(1866, 'میجان علیا', 22),
(1867, 'میرابادارجمند', 22),
(1868, 'نجف شهر', 22),
(1869, 'نرماشیر', 22),
(1870, 'نظام شهر', 22),
(1871, 'نگار', 22),
(1872, 'نودژ', 22),
(1873, 'هجدک', 22),
(1874, 'هرمزاباد', 22),
(1875, 'هماشهر', 22),
(1876, 'هنزا', 22),
(1877, 'هوتک', 22),
(1878, 'یزدان شهر', 22),
(1879, 'کرمانشاه', 23),
(1880, 'اسلام آباد غرب', 23),
(1881, 'سر پل ذهاب', 23),
(1882, 'سنقر', 23),
(1883, 'کنگاور', 23),
(1884, 'جوانرود', 23),
(1885, 'گیلانغرب', 23),
(1886, 'صحنه', 23),
(1887, 'ازگله', 23),
(1888, 'اگاه علیا', 23),
(1889, 'بانوره', 23),
(1890, 'باوله', 23),
(1891, 'باینگان', 23),
(1892, 'بیستون', 23),
(1893, 'پاوه', 23),
(1894, 'تازه آباد', 23),
(1895, 'تپه رش', 23),
(1896, 'ترک ویس', 23),
(1897, 'جعفراباد-کرمانشاه', 23),
(1898, 'حسن اباد-کرمانشاه', 23),
(1899, 'حمیل', 23),
(1900, 'خسروی', 23),
(1901, 'درکه', 23),
(1902, 'دوردشت', 23),
(1903, 'دولت اباد-کرمانشاه', 23),
(1904, 'دهلقین', 23),
(1905, 'رباط', 23),
(1906, 'روانسر', 23),
(1907, 'ریجاب', 23),
(1908, 'زاوله علیا', 23),
(1909, 'سراب ذهاب', 23),
(1910, 'سرمست', 23),
(1911, 'سطر', 23),
(1912, 'سلطان اباد-کرمانشاه', 23),
(1913, 'سنقراباد', 23),
(1914, 'سومار', 23),
(1915, 'شاهو', 23),
(1916, 'فرامان', 23),
(1917, 'فش', 23),
(1918, 'قزوینه', 23),
(1919, 'قصر شیرین', 23),
(1920, 'قلعه شیان', 23),
(1921, 'قیلان', 23),
(1922, 'کرکسار', 23),
(1923, 'کرند غرب', 23),
(1924, 'کندوله', 23),
(1925, 'کوزران', 23),
(1926, 'کیوه نان', 23),
(1927, 'گردکانه علیا', 23),
(1928, 'گودین', 23),
(1929, 'گهواره', 23),
(1930, 'مرزبانی', 23),
(1931, 'میان راهان', 23),
(1932, 'میراباد-کرمانشاه', 23),
(1933, 'نساردیره', 23),
(1934, 'نودشه', 23),
(1935, 'نوسود', 23),
(1936, 'هرسین', 23),
(1937, 'هفت اشیان', 23),
(1938, 'هلشی', 23),
(1939, 'یاسوج', 24),
(1940, 'دوگنبدان', 24),
(1941, 'دهدشت', 24),
(1942, 'لنده', 24),
(1943, 'چرام', 24),
(1944, 'سی سخت', 24),
(1945, 'لیکک', 24),
(1946, 'باشت', 24),
(1947, 'باباکلان', 24),
(1948, 'پاتاوه', 24),
(1949, 'چاه تلخاب علیا', 24),
(1950, 'چیتاب', 24),
(1951, 'دیشموک', 24),
(1952, 'دیل', 24),
(1953, 'سربیشه-کهگیلویه و بویراحمد', 24),
(1954, 'سرفاریاب', 24),
(1955, 'سوق', 24),
(1956, 'شاه بهرام', 24),
(1957, 'قلعه دختر', 24),
(1958, 'قلعه رئیسی', 24),
(1959, 'قلعه رییسی', 24),
(1960, 'گراب سفلی', 24),
(1961, 'مادوان', 24),
(1962, 'مارگون', 24),
(1963, 'مظفراباد', 24),
(1964, 'میمند-کهگیلویه و بویراحمد', 24),
(1965, 'گرگان', 25),
(1966, 'گنبدکاووس', 25),
(1967, 'کلاله', 25),
(1968, 'علی آباد', 25),
(1969, 'آزاد شهر', 25),
(1970, 'کرد کوی', 25),
(1971, 'بندر ترکمن', 25),
(1972, 'مراوه تپه', 25),
(1973, 'آق قلا', 25),
(1974, 'انبار آلوم', 25),
(1975, 'اینچه برون', 25),
(1976, 'بندر گز', 25),
(1977, 'تاتار علیا', 25),
(1978, 'تقی اباد-گلستان', 25),
(1979, 'جلین', 25),
(1980, 'حاجیکلاته', 25),
(1981, 'خان ببین', 25),
(1982, 'دلند', 25),
(1983, 'رامیان', 25),
(1984, 'سرخنکلاته', 25),
(1985, 'سنگدوین', 25),
(1986, 'سیمین شهر', 25),
(1987, 'عزیزاباد-گلستان', 25),
(1988, 'فاضل آباد', 25),
(1989, 'فراغی', 25),
(1990, 'قرق', 25),
(1991, 'کرند', 25),
(1992, 'گالیکش', 25),
(1993, 'گمیش تپه', 25),
(1994, 'مزرعه', 25),
(1995, 'مینودشت', 25),
(1996, 'نگین شهر', 25),
(1997, 'نوده خاندوز', 25),
(1998, 'نوکنده', 25),
(1999, 'رشت', 26),
(2000, 'لاهیجان', 26),
(2001, 'بندر انزلی', 26),
(2002, 'لنگرود', 26),
(2003, 'آستانه اشرفیه', 26),
(2004, 'رودسر', 26),
(2005, 'فومن', 26),
(2006, 'آستارا', 26),
(2007, 'آستانه پینچاه', 26),
(2008, 'آستانه تجن گوکه', 26),
(2009, 'آستانه تمچال', 26),
(2010, 'آستانه چورکوچان', 26),
(2011, 'آستانه چهارده', 26),
(2012, 'آستانه دهسر', 26),
(2013, 'آستانه سالک ده', 26),
(2014, 'آستانه سوخته کوه', 26),
(2015, 'آستانه صفرا بسته', 26),
(2016, 'آستانه کشل', 26),
(2017, 'آستانه کیسم', 26),
(2018, 'ابکنار', 26),
(2019, 'احمد سرگوراب', 26),
(2020, 'اسالم', 26),
(2021, 'اسکولک', 26),
(2022, 'املش', 26),
(2023, 'انزلی زیباکنار', 26),
(2024, 'انزلی طالب آباد', 26),
(2025, 'بارکوسرا', 26),
(2026, 'بازار جمعه', 26),
(2027, 'بازارخطبه سرا', 26),
(2028, 'بره سر', 26),
(2029, 'بلترک', 26),
(2030, 'بلسبنه', 26),
(2031, 'بندر انزلی _ منطقه آزاد', 26),
(2032, 'بندر انزلی_آبکنار', 26),
(2033, 'بندر انزلی_تربه گوده', 26),
(2034, 'بندر انزلی_جفرود', 26),
(2035, 'بندر انزلی_حسن رود', 26),
(2036, 'بندر انزلی_سنگاچین', 26),
(2037, 'بندر انزلی_شهر صنعتی', 26),
(2038, 'بندر انزلی_علی آباد', 26),
(2039, 'بندر انزلی_کپورچال', 26),
(2040, 'بندرانزلی_شانگهای پرده', 26),
(2041, 'بیورزین', 26),
(2042, 'پایین محله پاشاکی', 26),
(2043, 'پرگاپشت مهدی خانی', 26),
(2044, 'پروش پایین', 26),
(2045, 'پره سر', 26),
(2046, 'پلاسی', 26),
(2047, 'پلنگ پاره', 26),
(2048, 'پونل', 26),
(2049, 'توتکابن', 26),
(2050, 'جنگ سرا', 26),
(2051, 'جوکندان بزرگ', 26),
(2052, 'جیرکویه', 26),
(2053, 'جیرنده', 26),
(2054, 'جیرهنده', 26),
(2055, 'چابکسر', 26),
(2056, 'چاپارخانه', 26),
(2057, 'چوبر', 26),
(2058, 'حسن سرا', 26),
(2059, 'حویق', 26),
(2060, 'حیران', 26),
(2061, 'خرارود', 26),
(2062, 'خشکبیجار', 26),
(2063, 'خمام', 26),
(2064, 'خمام چوکام', 26),
(2065, 'خمام خشکبیجار', 26),
(2066, 'خمام خواچکین', 26),
(2067, 'خمام دافچاه', 26),
(2068, 'خمام شیجان', 26),
(2069, 'خمام فشتکه', 26),
(2070, 'خمام لله کاه', 26),
(2071, 'خمام مرزدشت', 26),
(2072, 'دستک', 26),
(2073, 'دهشال', 26),
(2074, 'دیلمان', 26),
(2075, 'دیوشل', 26),
(2076, 'رانکوه', 26),
(2077, 'رحیم آباد', 26),
(2078, 'رستم آباد', 26),
(2079, 'رشت امام زاده هاشم', 26),
(2080, 'رشت پیر بازار', 26),
(2081, 'رشت پیرده', 26),
(2082, 'رشت پیله ملا', 26),
(2083, 'رشت تخته پل', 26),
(2084, 'رشت جیرده', 26),
(2085, 'رشت رجب آباد', 26),
(2086, 'رشت سراوان', 26),
(2087, 'رشت سنگر', 26),
(2088, 'رشت شهر صنعتی لاکان', 26),
(2089, 'رشت فخب', 26),
(2090, 'رشت فلکده', 26),
(2091, 'رشت کفترود', 26),
(2092, 'رشت کماکل', 26),
(2093, 'رشت لاکان', 26),
(2094, 'رشت مبارک آباد', 26),
(2095, 'رضوانشهر', 26),
(2096, 'رودبار', 26),
(2097, 'سلوش', 26),
(2098, 'سیاهکل', 26),
(2099, 'سیبلی', 26),
(2100, 'شفت', 26),
(2101, 'شلمان', 26),
(2102, 'شوییل', 26),
(2103, 'شهر صنعتی', 26),
(2104, 'شیرکوه چهارده', 26),
(2105, 'شیرین نسا', 26),
(2106, 'شیله وشت', 26),
(2107, 'صومعه سرا', 26),
(2108, 'صومعه سرا  طاهر گوراب', 26),
(2109, 'صومعه سرا  فشخام', 26),
(2110, 'صومعه سرا چوبه', 26),
(2111, 'صومعه سرا خراط محله', 26),
(2112, 'صومعه سرا دوگور', 26),
(2113, 'صومعه سرا شیخ محله', 26),
(2114, 'صومعه سرا صوفیانده', 26),
(2115, 'صومعه سرا ضیابر', 26),
(2116, 'صومعه سرا قصاب سرا', 26),
(2117, 'صومعه سرا گوراب زرمیخ', 26),
(2118, 'صومعه سرا لیفشاگرد', 26),
(2119, 'صومعه سرا لیموده', 26),
(2120, 'صومعه سرا نفوت', 26),
(2121, 'صومعه سرا واقع دشت', 26),
(2122, 'صومعه سرا هند خاله', 26),
(2123, 'طول لات', 26),
(2124, 'علی اباد-گیلان', 26),
(2125, 'فومن الیان', 26),
(2126, 'فومن خشکنودهیان', 26),
(2127, 'فومن دهستان گشت', 26),
(2128, 'فومن زیده', 26),
(2129, 'فومن سیاه پیران', 26),
(2130, 'فومن شالتوک', 26),
(2131, 'فومن شالکوه', 26),
(2132, 'فومن فوشه', 26),
(2133, 'فومن قلعه رودخان', 26),
(2134, 'فومن کمادول', 26),
(2135, 'فومن گوراب پس', 26),
(2136, 'فومن لولمان', 26),
(2137, 'فومن ماکلوان', 26),
(2138, 'فومن نوگوراب', 26),
(2139, 'کجید', 26),
(2140, 'کلاچای', 26),
(2141, 'کلشتر', 26),
(2142, 'کلیشم', 26),
(2143, 'کوته کومه', 26),
(2144, 'کوچصفهان', 26),
(2145, 'کوچصفهان جوربیجارکل', 26),
(2146, 'کوچصفهان حسن آباد', 26),
(2147, 'کوچصفهان سده', 26),
(2148, 'کوچصفهان سنگر', 26),
(2149, 'کوچصفهان لاله دشت', 26),
(2150, 'کوکنه', 26),
(2151, 'کیاشهر', 26),
(2152, 'گرمابدشت', 26),
(2153, 'گرماور', 26),
(2154, 'گشت-گیلان', 26),
(2155, 'لاهیجان آهندان', 26),
(2156, 'لاهیجان بازکیا گوراب', 26),
(2157, 'لاهیجان بیجار بنه', 26),
(2158, 'لاهیجان پاشاکی', 26),
(2159, 'لاهیجان جواهر پشته', 26),
(2160, 'لاهیجان چفل', 26),
(2161, 'لاهیجان رودبنه', 26),
(2162, 'لاهیجان سیاهگوراب', 26),
(2163, 'لاهیجان شهر صنعتی', 26),
(2164, 'لاهیجان کوچکده', 26),
(2165, 'لاهیجان کوشال', 26),
(2166, 'لاهیجان لفمجان', 26),
(2167, 'لاهیجان لیالستان', 26),
(2168, 'لاهیجان نخجیر کلایه', 26),
(2169, 'لاهیجان نوبیجار', 26),
(2170, 'لسکوکلایه', 26),
(2171, 'لشت نشاء', 26),
(2172, 'لنگرود اطاقور', 26),
(2173, 'لنگرود پرشکوه', 26),
(2174, 'لنگرود پیر پشته', 26),
(2175, 'لنگرود چاف و چمخاله', 26),
(2176, 'لنگرود خراط محله', 26),
(2177, 'لنگرود دریاسر', 26),
(2178, 'لنگرود دهستان گل سفید', 26),
(2179, 'لنگرود سالکویه', 26),
(2180, 'لنگرود شلمان', 26),
(2181, 'لنگرود فتیده', 26),
(2182, 'لنگرود کومله', 26),
(2183, 'لنگرود لوکلایه', 26),
(2184, 'لنگرود یعقوبیه', 26),
(2185, 'لوشان', 26),
(2186, 'لولمان', 26),
(2187, 'لوندویل', 26),
(2188, 'لیچارکی حسن رود', 26),
(2189, 'لیسار', 26),
(2190, 'لیش', 26),
(2191, 'ماسال', 26),
(2192, 'ماسوله', 26),
(2193, 'مرجقل', 26),
(2194, 'مرکیه', 26),
(2195, 'مشند', 26),
(2196, 'ملاسرا', 26),
(2197, 'منجیل', 26),
(2198, 'نوخاله اکبری', 26),
(2199, 'واجارگاه', 26),
(2200, 'ویرمونی', 26),
(2201, 'ویشان', 26),
(2202, 'هشتپر', 26),
(2203, 'خرم آباد', 27),
(2204, 'بروجرد', 27),
(2205, 'دورود', 27),
(2206, 'کوهدشت', 27),
(2207, 'نورآباد', 27),
(2208, 'الیگودرز', 27),
(2209, 'ازنا', 27),
(2210, 'پلدختر', 27),
(2211, 'اشتره گل گل', 27),
(2212, 'اشترینان', 27),
(2213, 'افرینه', 27),
(2214, 'الشتر', 27),
(2215, 'ایستگاه تنگ هفت', 27),
(2216, 'برخوردار', 27),
(2217, 'بندیزه', 27),
(2218, 'بیرانشهر', 27),
(2219, 'بیرانوند', 27),
(2220, 'پاعلم (پل تنگ )', 27),
(2221, 'پل شوراب پایین', 27),
(2222, 'تقی اباد-لرستان', 27),
(2223, 'چالانچولان', 27),
(2224, 'چاه ذوالفقار', 27),
(2225, 'چشمه کیزاب علیا', 27),
(2226, 'چقابل', 27),
(2227, 'چم پلک', 27),
(2228, 'چم سنگر', 27),
(2229, 'چمشک زیرتنگ', 27),
(2230, 'چمن سلطان', 27),
(2231, 'حیه', 27),
(2232, 'خوشناموند', 27),
(2233, 'درب گنبد', 27),
(2234, 'دره گرگ', 27),
(2235, 'دم باغ', 27),
(2236, 'ده رحم', 27),
(2237, 'رازان', 27),
(2238, 'زاغه', 27),
(2239, 'ژان', 27),
(2240, 'سپید دشت', 27),
(2241, 'سراب دوره', 27),
(2242, 'سراب سیاهپوش', 27),
(2243, 'سوری', 27),
(2244, 'سیاه گوشی (پل هرو)', 27),
(2245, 'شاهپوراباد', 27),
(2246, 'شول آباد', 27),
(2247, 'فرهاداباد', 27),
(2248, 'فیروزآباد', 27),
(2249, 'قلعه بزنوید', 27),
(2250, 'کاغه', 27),
(2251, 'کونانی', 27),
(2252, 'کوهنانی', 27),
(2253, 'کهریزوروشت', 27),
(2254, 'کیزاندره', 27),
(2255, 'گراب', 27),
(2256, 'ماسور', 27),
(2257, 'مرگ سر', 27),
(2258, 'معمولان', 27),
(2259, 'مکینه حکومتی', 27),
(2260, 'مومن آباد', 27),
(2261, 'میان تاگان', 27),
(2262, 'واشیان نصیرتپه', 27),
(2263, 'ویسیان', 27),
(2264, 'هفت چشمه', 27),
(2265, 'ساری', 28),
(2266, 'بابل', 28),
(2267, 'آمل', 28),
(2268, 'قائم شهر', 28),
(2269, 'نوشهر', 28),
(2270, 'تنکابن', 28),
(2271, 'بابلسر', 28),
(2272, 'چالوس', 28),
(2273, 'آلاشت', 28),
(2274, 'اتو', 28),
(2275, 'ارطه', 28),
(2276, 'اروست', 28),
(2277, 'اسبوکلا', 28),
(2278, 'اسلام اباد-مازندران', 28),
(2279, 'اغوزکتی', 28),
(2280, 'امافت', 28),
(2281, 'امامزاده عبدالله', 28),
(2282, 'امیرکلا', 28),
(2283, 'اوز-مازندران', 28),
(2284, 'اهنگرکلا', 28),
(2285, 'ایزد شهر', 28),
(2286, 'اینج دان', 28),
(2287, 'بادابسر', 28),
(2288, 'بالاجنیدلاک پل', 28),
(2289, 'بالادسته رکن کنار', 28),
(2290, 'بالادواب', 28),
(2291, 'بالاهولار', 28),
(2292, 'باییجان', 28),
(2293, 'بلده', 28),
(2294, 'بندپی', 28),
(2295, 'بنفشه ده', 28),
(2296, 'بهشهر', 28),
(2297, 'بهنمیر', 28),
(2298, 'بیزکی', 28),
(2299, 'بیشه بنه', 28),
(2300, 'بیشه سر', 28),
(2301, 'پالند', 28),
(2302, 'پایین زرندین', 28),
(2303, 'پایین هولار', 28),
(2304, 'پل سفید', 28),
(2305, 'پول', 28),
(2306, 'تاکام', 28),
(2307, 'تاکر', 28),
(2308, 'تمل', 28),
(2309, 'تیرتاش', 28),
(2310, 'جنت رودبار', 28),
(2311, 'جواهرده', 28),
(2312, 'جویبار', 28),
(2313, 'چرات', 28),
(2314, 'چلمردی', 28),
(2315, 'چلندر', 28),
(2316, 'چمستان', 28),
(2317, 'حاجی کلاصنم', 28),
(2318, 'خرم آباد', 28),
(2319, 'خشک دره', 28),
(2320, 'خطیرکلا', 28),
(2321, 'خلیل شهر', 28),
(2322, 'خورشید (امامیه )', 28),
(2323, 'خوش رودپی', 28),
(2324, 'دابودشت', 28),
(2325, 'دارابکلا', 28),
(2326, 'دامداری حاج عزیزمجریان', 28),
(2327, 'دامداری حسن ابوطالبی', 28),
(2328, 'درازکش', 28),
(2329, 'دلیر', 28),
(2330, 'ده میان', 28),
(2331, 'رامسر', 28),
(2332, 'رستمکلا', 28),
(2333, 'رکابدارکلا', 28),
(2334, 'رویان', 28),
(2335, 'ریکنده', 28),
(2336, 'رینه', 28),
(2337, 'رییس کلا', 28),
(2338, 'زاغمرز', 28),
(2339, 'زرگر محله', 28),
(2340, 'زیرآب', 28),
(2341, 'سادات محله', 28),
(2342, 'سرخرود', 28),
(2343, 'سرلنگا', 28),
(2344, 'سفیدچاه', 28),
(2345, 'سلمان شهر', 28),
(2346, 'سلیمان اباد', 28),
(2347, 'سنگتاب', 28),
(2348, 'سنگده', 28),
(2349, 'سوا', 28),
(2350, 'سورک', 28),
(2351, 'سیاه بیشه', 28),
(2352, 'شورکش', 28),
(2353, 'شهرک صنعتی گهرباران', 28),
(2354, 'شهیداباد', 28),
(2355, 'شیرکلا', 28),
(2356, 'شیرگاه', 28),
(2357, 'شیرود', 28),
(2358, 'صلاح الدین کلا', 28),
(2359, 'عباس آباد', 28),
(2360, 'عرب خیل', 28),
(2361, 'فرح اباد (خزراباد)', 28),
(2362, 'فریدونکنار', 28),
(2363, 'فریم', 28),
(2364, 'قادیکلا', 28),
(2365, 'قلعه گردن', 28),
(2366, 'کاسگرمحله', 28),
(2367, 'کتالم و سادات شهر', 28),
(2368, 'کترا', 28),
(2369, 'کتی لته', 28),
(2370, 'کجور', 28),
(2371, 'کردیچال', 28),
(2372, 'کشکو', 28),
(2373, 'کلارآباد', 28),
(2374, 'کلاردشت', 28),
(2375, 'کلنو', 28),
(2376, 'کله بست', 28),
(2377, 'کوهی خیل', 28),
(2378, 'کیاسر', 28),
(2379, 'کیاکلا', 28),
(2380, 'گاوانکلا', 28),
(2381, 'گتاب', 28),
(2382, 'گردرودبار', 28),
(2383, 'گزنک', 28),
(2384, 'گلعلی اباد', 28),
(2385, 'گلندرود', 28),
(2386, 'گلوگاه', 28),
(2387, 'گلوگاه', 28),
(2388, 'لاک تراشان', 28),
(2389, 'لشکنار', 28);
INSERT INTO `cities` (`id`, `name`, `province_id`) VALUES
(2390, 'لفور (لفورک )', 28),
(2391, 'ماچک پشت', 28),
(2392, 'محمودآباد', 28),
(2393, 'مران سه هزار', 28),
(2394, 'مرزن آباد', 28),
(2395, 'مرزیکلا', 28),
(2396, 'معلم کلا', 28),
(2397, 'میان دره', 28),
(2398, 'میان کوه سادات', 28),
(2399, 'نارنج بن', 28),
(2400, 'نشتارود', 28),
(2401, 'نکا', 28),
(2402, 'نور', 28),
(2403, 'واسکس', 28),
(2404, 'ورسک', 28),
(2405, 'وسطی کلا', 28),
(2406, 'هادی شهر', 28),
(2407, 'هچیرود', 28),
(2408, 'هیچرود', 28),
(2409, 'اراک', 29),
(2410, 'ساوه', 29),
(2411, 'خمین', 29),
(2412, 'محلات', 29),
(2413, 'دلیجان', 29),
(2414, 'مامونیه', 29),
(2415, 'شازند', 29),
(2416, 'مهاجران', 29),
(2417, 'آستانه', 29),
(2418, 'آشتیان', 29),
(2419, 'آوه', 29),
(2420, 'ادشته', 29),
(2421, 'استوه', 29),
(2422, 'اصفهانک', 29),
(2423, 'الویر', 29),
(2424, 'امامزاده ورچه', 29),
(2425, 'اناج', 29),
(2426, 'اهنگران', 29),
(2427, 'اهو', 29),
(2428, 'باقراباد', 29),
(2429, 'بالقلو', 29),
(2430, 'بزیجان', 29),
(2431, 'پرندک', 29),
(2432, 'تفرش', 29),
(2433, 'تواندشت علیا', 29),
(2434, 'توره', 29),
(2435, 'جاورسیان', 29),
(2436, 'جزنق', 29),
(2437, 'چمران-مرکزی', 29),
(2438, 'چهارچریک', 29),
(2439, 'چهارچشمه', 29),
(2440, 'حسین اباد-مرکزی', 29),
(2441, 'حکیم اباد', 29),
(2442, 'خسروبیگ', 29),
(2443, 'خشکرود', 29),
(2444, 'خنجین', 29),
(2445, 'خنداب', 29),
(2446, 'خوراوند', 29),
(2447, 'خورهه', 29),
(2448, 'داود آباد', 29),
(2449, 'دخان', 29),
(2450, 'دوزج', 29),
(2451, 'دهنو-مرکزی', 29),
(2452, 'رازقان', 29),
(2453, 'رباطکفسان', 29),
(2454, 'رباطمراد', 29),
(2455, 'ریحان علیا', 29),
(2456, 'زاغر', 29),
(2457, 'زاویه', 29),
(2458, 'ساروق', 29),
(2459, 'سامان-مرکزی', 29),
(2460, 'سرسختی بالا', 29),
(2461, 'سلطان اباد-مرکزی', 29),
(2462, 'سمقاور', 29),
(2463, 'سنجان', 29),
(2464, 'سیاوشان', 29),
(2465, 'شهباز', 29),
(2466, 'شهراب-مرکزی', 29),
(2467, 'صالح اباد', 29),
(2468, 'صدراباد', 29),
(2469, 'علیشار', 29),
(2470, 'عیسی اباد', 29),
(2471, 'غرق آباد', 29),
(2472, 'فرفهان', 29),
(2473, 'فرمهین', 29),
(2474, 'فشک', 29),
(2475, 'قاقان', 29),
(2476, 'قدمگاه-مرکزی', 29),
(2477, 'قورچی باشی', 29),
(2478, 'کارچان', 29),
(2479, 'کتیران بالا', 29),
(2480, 'کرهرود', 29),
(2481, 'کزاز', 29),
(2482, 'کمیجان', 29),
(2483, 'کهک-مرکزی', 29),
(2484, 'گلدشت-مرکزی', 29),
(2485, 'لکان', 29),
(2486, 'لنجرود', 29),
(2487, 'لوزدرعلیا', 29),
(2488, 'مالمیر', 29),
(2489, 'مراغه-مرکزی', 29),
(2490, 'مزرعه نو', 29),
(2491, 'میشیجان علیا', 29),
(2492, 'میلاجرد', 29),
(2493, 'نخجیروان', 29),
(2494, 'نراق', 29),
(2495, 'نوبران', 29),
(2496, 'نهرمیان', 29),
(2497, 'نیمور', 29),
(2498, 'ورچه', 29),
(2499, 'وفس', 29),
(2500, 'هزاوه', 29),
(2501, 'هفته', 29),
(2502, 'هندودر', 29),
(2503, 'یحیی اباد-مرکزی', 29),
(2504, 'یل اباد', 29),
(2505, 'بندرعباس', 30),
(2506, 'کیش', 30),
(2507, 'میناب', 30),
(2508, 'بستک', 30),
(2509, 'قشم', 30),
(2510, 'بندر لنگه', 30),
(2511, 'بندر جاسک', 30),
(2512, 'دهبارز', 30),
(2513, 'ابگرم خورگو', 30),
(2514, 'ابوموسی', 30),
(2515, 'باغات', 30),
(2516, 'بندر', 30),
(2517, 'بندرمغویه', 30),
(2518, 'بندزرک', 30),
(2519, 'بیکاه', 30),
(2520, 'پارسیان', 30),
(2521, 'پدل', 30),
(2522, 'پشته ایسین', 30),
(2523, 'پل شرقی', 30),
(2524, 'تازیان پائین', 30),
(2525, 'تخت', 30),
(2526, 'تیاب', 30),
(2527, 'تیرور', 30),
(2528, 'جزیره سیری', 30),
(2529, 'جزیره لارک شهری', 30),
(2530, 'جزیره لاوان', 30),
(2531, 'جغین', 30),
(2532, 'جناح', 30),
(2533, 'چارک', 30),
(2534, 'حاجی آباد', 30),
(2535, 'حسن لنگی پایین', 30),
(2536, 'خمیر', 30),
(2537, 'درپهن', 30),
(2538, 'درگهان', 30),
(2539, 'دژگان', 30),
(2540, 'دشتی', 30),
(2541, 'دهنگ', 30),
(2542, 'رویدر', 30),
(2543, 'زیارتعلی', 30),
(2544, 'سردشت', 30),
(2545, 'سرگز', 30),
(2546, 'سندرک', 30),
(2547, 'سوزا', 30),
(2548, 'سیاهو', 30),
(2549, 'سیریک', 30),
(2550, 'فارغان', 30),
(2551, 'فین', 30),
(2552, 'قلعه قاضی', 30),
(2553, 'کلورجکدان', 30),
(2554, 'کمشک', 30),
(2555, 'کنگ', 30),
(2556, 'کوخردهرنگ', 30),
(2557, 'کوشکنار', 30),
(2558, 'کوهستک', 30),
(2559, 'گروک', 30),
(2560, 'گزیر', 30),
(2561, 'گوربند', 30),
(2562, 'گونمردی', 30),
(2563, 'گوهران', 30),
(2564, 'گوهرت', 30),
(2565, 'لمزان', 30),
(2566, 'ماشنگی', 30),
(2567, 'هرمز', 30),
(2568, 'هشتبندی', 30),
(2569, 'هنگام جدید', 30),
(2570, 'همدان', 31),
(2571, 'ملایر', 31),
(2572, 'نهاوند', 31),
(2573, 'تویسرکان', 31),
(2574, 'اسد آباد', 31),
(2575, 'کبودر آهنگ', 31),
(2576, 'بهار', 31),
(2577, 'رزن', 31),
(2578, 'آجین', 31),
(2579, 'ازناو', 31),
(2580, 'ازندریان', 31),
(2581, 'اسلام اباد-همدان', 31),
(2582, 'اشتران', 31),
(2583, 'اکنلو', 31),
(2584, 'اورزمان', 31),
(2585, 'باباپیر', 31),
(2586, 'بابارستم', 31),
(2587, 'باباقاسم', 31),
(2588, 'برزول', 31),
(2589, 'پادگان قهرمان', 31),
(2590, 'پایگاه نوژه', 31),
(2591, 'پرلوک', 31),
(2592, 'تجرک', 31),
(2593, 'جعفریه (قلعه جعفربیک )', 31),
(2594, 'جنت اباد-همدان', 31),
(2595, 'جورقان', 31),
(2596, 'جوزان-همدان', 31),
(2597, 'جوکار', 31),
(2598, 'جهان اباد', 31),
(2599, 'چانگرین', 31),
(2600, 'چنارسفلی', 31),
(2601, 'چنارعلیا', 31),
(2602, 'حسین ابادبهارعاشوری', 31),
(2603, 'داق داق اباد', 31),
(2604, 'دمق', 31),
(2605, 'دهفول', 31),
(2606, 'دیناراباد', 31),
(2607, 'زنگنه', 31),
(2608, 'سامن', 31),
(2609, 'سرکان', 31),
(2610, 'شهرک صنعتی بوعلی', 31),
(2611, 'شیرین سو', 31),
(2612, 'صالح آباد', 31),
(2613, 'طویلان سفلی', 31),
(2614, 'علیصدر', 31),
(2615, 'فامنین', 31),
(2616, 'فرسفج', 31),
(2617, 'فیروزان', 31),
(2618, 'قروه در جزین', 31),
(2619, 'قهاوند', 31),
(2620, 'قهوردسفلی', 31),
(2621, 'کوریجان', 31),
(2622, 'کوزره', 31),
(2623, 'کوهین-همدان', 31),
(2624, 'گل تپه', 31),
(2625, 'گنبد', 31),
(2626, 'گیان', 31),
(2627, 'لالجین', 31),
(2628, 'مریانج', 31),
(2629, 'موسی اباد-همدان', 31),
(2630, 'مهاجران', 31),
(2631, 'میانده-همدان', 31),
(2632, 'ولاشجرد', 31),
(2633, 'ویرایی', 31),
(2634, 'همه کسی', 31),
(2635, 'یزد', 32),
(2636, 'میبد', 32),
(2637, 'اردکان', 32),
(2638, 'بافق', 32),
(2639, 'مهریز', 32),
(2640, 'ابرکوه', 32),
(2641, 'تفت', 32),
(2642, 'اشکذر', 32),
(2643, 'احمد آباد', 32),
(2644, 'ارنان', 32),
(2645, 'اسفنداباد', 32),
(2646, 'اسفیج', 32),
(2647, 'انارستان-یزد', 32),
(2648, 'بفروئیه', 32),
(2649, 'بنستان', 32),
(2650, 'بهاباد', 32),
(2651, 'بهادران', 32),
(2652, 'تنگ چنار (چنار)', 32),
(2653, 'حمیدیا', 32),
(2654, 'خضر آباد', 32),
(2655, 'دهشیر', 32),
(2656, 'زارچ', 32),
(2657, 'زرین', 32),
(2658, 'شاهدیه', 32),
(2659, 'عقدا', 32),
(2660, 'علی اباد-یزد', 32),
(2661, 'فتح اباد-یزد', 32),
(2662, 'فراغه', 32),
(2663, 'فهرج-یزد', 32),
(2664, 'کوشک-یزد', 32),
(2665, 'مبارکه-یزد', 32),
(2666, 'مروست', 32),
(2667, 'مهردشت', 32),
(2668, 'ناحیه صنعتی پیشکوه', 32),
(2669, 'ناحیه صنعتی گاریزات', 32),
(2670, 'ندوشن', 32),
(2671, 'نصراباد', 32),
(2672, 'نیر', 32),
(2673, 'هرات', 32);

-- --------------------------------------------------------

--
-- Table structure for table `colors`
--

CREATE TABLE `colors` (
  `id` int(11) NOT NULL,
  `color_code` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `color_name` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `comments`
--

CREATE TABLE `comments` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `comment` text NOT NULL,
  `status` enum('active','inactive') NOT NULL DEFAULT 'inactive',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `comments`
--

INSERT INTO `comments` (`id`, `user_id`, `product_id`, `comment`, `status`, `created_at`) VALUES
(4, 2, 1, 'زیباس', 'active', '2023-12-01 07:34:42');

-- --------------------------------------------------------

--
-- Table structure for table `favorites`
--

CREATE TABLE `favorites` (
  `id` int(11) NOT NULL,
  `user_id` int(255) NOT NULL,
  `product_id` int(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `favorites`
--

INSERT INTO `favorites` (`id`, `user_id`, `product_id`, `created_at`) VALUES
(14, 1, 4, '2023-11-29 19:05:37'),
(15, 2, 1, '2023-12-01 07:51:52');

-- --------------------------------------------------------

--
-- Table structure for table `managers`
--

CREATE TABLE `managers` (
  `id` int(11) NOT NULL,
  `first_name` tinytext,
  `last_name` tinytext,
  `mobile` tinytext NOT NULL,
  `email` tinytext NOT NULL,
  `password` tinytext,
  `gender` enum('male','female') NOT NULL DEFAULT 'female',
  `level` enum('manager','operator') DEFAULT NULL,
  `status` enum('active','inactive','suspend') NOT NULL DEFAULT 'active',
  `last_logined_at` datetime DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `managers`
--

INSERT INTO `managers` (`id`, `first_name`, `last_name`, `mobile`, `email`, `password`, `gender`, `level`, `status`, `last_logined_at`, `created_at`, `updated_at`) VALUES
(1, 'شایان', 'نیک روش', '09152353281', 'shayannik80@gmail.com', '$2y$10$o9w5HPJdIHZmvuh5m8jGzeh/1i7Nfe0Z90W1qXlUpSfygwOnHTVnC', 'male', 'manager', 'active', '2022-12-01 12:14:04', '2022-12-01 12:14:52', '2023-12-31 14:55:43'),
(5, 'نام', 'سیسی', '09381212121', 'nahisdss@gmail.com', '$2y$10$y/alCGf.NzXyNCAJArlV4uNtEM2hKZ2QCz5599EjOo15hjzjqJDTe', 'male', 'manager', 'active', NULL, '2024-01-03 10:42:52', '2024-01-03 10:42:52');

-- --------------------------------------------------------

--
-- Table structure for table `manager_photo`
--

CREATE TABLE `manager_photo` (
  `id` int(11) NOT NULL,
  `photo_id` int(11) NOT NULL,
  `manager_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `memory`
--

CREATE TABLE `memory` (
  `id` int(11) NOT NULL,
  `memory_name` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `memory_size` int(11) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

-- --------------------------------------------------------

--
-- Table structure for table `orders`
--

CREATE TABLE `orders` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `tracking_code` tinytext CHARACTER SET utf8 NOT NULL,
  `total_amount` int(11) NOT NULL,
  `amount_payable` int(11) NOT NULL,
  `submit_cost` int(11) NOT NULL DEFAULT '0',
  `status` enum('success','failed') CHARACTER SET utf8 NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `orders`
--

INSERT INTO `orders` (`id`, `user_id`, `tracking_code`, `total_amount`, `amount_payable`, `submit_cost`, `status`, `created_at`, `updated_at`) VALUES
(8, 1, 'PSO-4839241672', 1100000, 1000000, 0, 'success', '2024-02-05 18:29:28', '2024-02-05 18:29:32');

-- --------------------------------------------------------

--
-- Table structure for table `order_product`
--

CREATE TABLE `order_product` (
  `id` int(11) NOT NULL,
  `order_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `price` double NOT NULL,
  `price_discounted` double NOT NULL,
  `quantity` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `order_product`
--

INSERT INTO `order_product` (`id`, `order_id`, `product_id`, `price`, `price_discounted`, `quantity`) VALUES
(4, 8, 2, 1100000, 1000000, 1);

-- --------------------------------------------------------

--
-- Table structure for table `payments`
--

CREATE TABLE `payments` (
  `id` int(20) NOT NULL,
  `order_id` int(11) NOT NULL,
  `pay_key` tinytext CHARACTER SET utf8 NOT NULL,
  `track_id` int(11) NOT NULL,
  `payment_track_id` int(11) DEFAULT NULL,
  `amount_payable` int(11) NOT NULL,
  `gateway_status` int(11) NOT NULL,
  `status` enum('success','failed') CHARACTER SET utf8 NOT NULL DEFAULT 'failed',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `payments`
--

INSERT INTO `payments` (`id`, `order_id`, `pay_key`, `track_id`, `payment_track_id`, `amount_payable`, `gateway_status`, `status`, `created_at`, `updated_at`) VALUES
(3, 4, 'e82e50ae94ca760988351ca403118c33', 1338260, NULL, 12000000, 1, 'failed', '2024-01-27 07:42:42', '2024-01-27 07:42:42'),
(4, 5, 'eaf056711ba789034cdc7b59ee3b4ebb', 1338263, 14074828, 13000000, 10, 'success', '2024-01-27 07:53:42', '2024-01-27 07:53:43'),
(5, 6, 'd8414614afb4dcd3468c1e2d273f5747', 1340243, NULL, 1000000, 10, 'failed', '2024-02-05 18:27:07', '2024-02-05 18:27:07'),
(6, 7, 'd8414614afb4dcd3468c1e2d273f5747', 1340243, NULL, 1000000, 10, 'failed', '2024-02-05 18:28:41', '2024-02-05 18:28:41'),
(7, 8, 'd8414614afb4dcd3468c1e2d273f5747', 1340243, 56804392, 1000000, 10, 'success', '2024-02-05 18:29:28', '2024-02-05 18:29:32');

-- --------------------------------------------------------

--
-- Table structure for table `photos`
--

CREATE TABLE `photos` (
  `id` int(11) NOT NULL,
  `name` tinytext NOT NULL,
  `src` text NOT NULL,
  `suffix` tinytext NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `photos`
--

INSERT INTO `photos` (`id`, `name`, `src`, `suffix`, `created_at`) VALUES
(12, '57b72980fb7efcb1192fdbd092634d14.jpg', '/images/articles/', 'jpg', '2024-01-09 15:00:54'),
(42, '259225bd9eea67b642ff3d6c94125a0e.jpg', '/images/products/', 'jpg', '2024-02-16 16:56:18'),
(46, '2409cf0cbcccb9454e202023f384caa8.jpg', '/images/articles/', 'jpg', '2024-02-16 16:59:46'),
(56, '6a8d713d59df9b99a5c722cb861e4869.jpg', '/images/banners/', 'jpg', '2024-02-16 18:49:08'),
(57, 'a70fdf6584935ef0aea4dd82ab5c3f00.jpg', '/images/banners/', 'jpg', '2024-02-16 18:49:14'),
(58, '47085c16f408270d24b6e07e4b2d8a9b.gif', '/images/banners/', 'gif', '2024-02-16 18:49:22'),
(59, 'e07f1235e6aa5390101b8f5af58fe12f.jpg', '/images/banners/', 'jpg', '2024-02-16 18:49:32'),
(60, '6d53dccfeaa8d6fa28b095a7a108f838.jpg', '/images/banners/', 'jpg', '2024-02-16 18:49:37');

-- --------------------------------------------------------

--
-- Table structure for table `photo_product`
--

CREATE TABLE `photo_product` (
  `id` int(11) NOT NULL,
  `photo_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `sort` tinyint(3) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `photo_product`
--

INSERT INTO `photo_product` (`id`, `photo_id`, `product_id`, `sort`) VALUES
(5, 42, 1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `id` int(11) NOT NULL,
  `category_id` int(11) NOT NULL,
  `brand_id` int(11) NOT NULL,
  `tracking_code` tinytext,
  `title` text NOT NULL,
  `english_title` text NOT NULL,
  `price` int(11) NOT NULL,
  `price_discounted` int(11) NOT NULL DEFAULT '0',
  `stock` int(11) NOT NULL DEFAULT '0',
  `review` mediumtext NOT NULL,
  `description` mediumtext NOT NULL,
  `status` enum('active','inactive','unavailable','stop_selling') NOT NULL DEFAULT 'inactive',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`id`, `category_id`, `brand_id`, `tracking_code`, `title`, `english_title`, `price`, `price_discounted`, `stock`, `review`, `description`, `status`, `created_at`, `updated_at`) VALUES
(1, 7, 1, '123456789123', 'مک', 'mac', 12000000, 0, 0, 'عالی', '<p>عالی</p>', 'active', '2022-11-09 17:53:59', '2024-01-29 14:45:04'),
(2, 7, 1, 'test', 'لمسی', 'mobile', 1100000, 1000000, 3, 'عالی', '<p>adasdas</p>', 'active', '2022-11-10 12:43:22', '2024-02-05 18:29:28'),
(3, 6, 1, '123456789124', 'دو قلو', 'freezer', 12000000, 11000000, 4, '<p>خوبه</p>', '<p>سرما</p>', 'active', '2023-10-10 15:17:58', '2023-12-16 14:33:52'),
(4, 6, 1, '123456789125', 'ساید', 'side', 20000000, 19500000, 5, '<p>خوبه</p>', '<p>زیبا جا دار</p>', 'active', '2023-10-11 15:05:35', '2023-10-22 15:17:40');

-- --------------------------------------------------------

--
-- Table structure for table `provinces`
--

CREATE TABLE `provinces` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `area_code` varchar(5) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `provinces`
--

INSERT INTO `provinces` (`id`, `name`, `area_code`) VALUES
(2, 'آذربایجان شرقی', '041'),
(3, 'آذربایجان غربی', '044'),
(4, 'اردبیل', '045'),
(5, 'اصفهان', '031'),
(6, 'البرز', '026'),
(7, 'ایلام', '084'),
(8, 'بوشهر', '077'),
(9, 'تهران', '021'),
(10, 'چهار محال و بختیاری', '038'),
(11, 'خراسان جنوبی', '056'),
(12, 'خراسان رضوی', '051'),
(13, 'خراسان شمالی', '058'),
(14, 'خوزستان', '061'),
(15, 'زنجان', '024'),
(16, 'سمنان', '023'),
(17, 'سیستان و بلوچستان', '054'),
(18, 'فارس', '071'),
(19, 'قزوین', '028'),
(20, 'قم', '025'),
(21, 'کردستان', '087'),
(22, 'کرمان', '034'),
(23, 'کرمانشاه', '083'),
(24, 'کهگیلویه و بویراحمد', '074'),
(25, 'گلستان', '017'),
(26, 'گیلان', '013'),
(27, 'لرستان', '066'),
(28, 'مازندران', '011'),
(29, 'مرکزی', '086'),
(30, 'هرمزگان', '076'),
(31, 'همدان', '081'),
(32, 'یزد', '035');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `first_name` tinytext,
  `last_name` tinytext,
  `national_code` tinytext,
  `mobile` tinytext NOT NULL,
  `email` tinytext,
  `gender` enum('male','female') NOT NULL DEFAULT 'female',
  `status` enum('active','inactive','suspend') NOT NULL DEFAULT 'active',
  `last_logined_at` datetime DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `first_name`, `last_name`, `national_code`, `mobile`, `email`, `gender`, `status`, `last_logined_at`, `created_at`, `updated_at`) VALUES
(1, 'شایان', 'نیک روش', '0925705160', '09152353281', 'shayannik80@gmail.com', '', 'active', '2023-09-25 12:01:29', '2023-09-25 12:02:11', '2023-12-20 16:09:16'),
(2, 'پوری', 'آزاد', '0925705160', '09908595090', '', 'male', 'active', NULL, '2023-10-07 14:25:02', '2023-10-08 07:54:24');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `addresses`
--
ALTER TABLE `addresses`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `address_order`
--
ALTER TABLE `address_order`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `aritcle_photo`
--
ALTER TABLE `aritcle_photo`
  ADD PRIMARY KEY (`id`),
  ADD KEY `photo_id` (`photo_id`);

--
-- Indexes for table `articles`
--
ALTER TABLE `articles`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `banners`
--
ALTER TABLE `banners`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `banner_photo`
--
ALTER TABLE `banner_photo`
  ADD PRIMARY KEY (`id`),
  ADD KEY `photo_id` (`photo_id`);

--
-- Indexes for table `brands`
--
ALTER TABLE `brands`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cities`
--
ALTER TABLE `cities`
  ADD PRIMARY KEY (`id`),
  ADD KEY `cn_cities_states` (`province_id`);

--
-- Indexes for table `colors`
--
ALTER TABLE `colors`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user` (`user_id`),
  ADD KEY `product` (`product_id`);

--
-- Indexes for table `favorites`
--
ALTER TABLE `favorites`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `managers`
--
ALTER TABLE `managers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `manager_photo`
--
ALTER TABLE `manager_photo`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `photo_id` (`photo_id`);

--
-- Indexes for table `memory`
--
ALTER TABLE `memory`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `order_product`
--
ALTER TABLE `order_product`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `payments`
--
ALTER TABLE `payments`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `photos`
--
ALTER TABLE `photos`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `photo_product`
--
ALTER TABLE `photo_product`
  ADD PRIMARY KEY (`id`),
  ADD KEY `photo_product_photo_id_foreign` (`photo_id`);

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`),
  ADD KEY `category` (`category_id`),
  ADD KEY `brand` (`brand_id`);

--
-- Indexes for table `provinces`
--
ALTER TABLE `provinces`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `addresses`
--
ALTER TABLE `addresses`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=84;

--
-- AUTO_INCREMENT for table `address_order`
--
ALTER TABLE `address_order`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `aritcle_photo`
--
ALTER TABLE `aritcle_photo`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `articles`
--
ALTER TABLE `articles`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `banners`
--
ALTER TABLE `banners`
  MODIFY `id` int(40) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `banner_photo`
--
ALTER TABLE `banner_photo`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT for table `brands`
--
ALTER TABLE `brands`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `cities`
--
ALTER TABLE `cities`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2674;

--
-- AUTO_INCREMENT for table `colors`
--
ALTER TABLE `colors`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `comments`
--
ALTER TABLE `comments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `favorites`
--
ALTER TABLE `favorites`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT for table `managers`
--
ALTER TABLE `managers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `manager_photo`
--
ALTER TABLE `manager_photo`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `memory`
--
ALTER TABLE `memory`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `order_product`
--
ALTER TABLE `order_product`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `payments`
--
ALTER TABLE `payments`
  MODIFY `id` int(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `photos`
--
ALTER TABLE `photos`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=61;

--
-- AUTO_INCREMENT for table `photo_product`
--
ALTER TABLE `photo_product`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `provinces`
--
ALTER TABLE `provinces`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=33;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `aritcle_photo`
--
ALTER TABLE `aritcle_photo`
  ADD CONSTRAINT `article_photo_photo_id_foreign` FOREIGN KEY (`photo_id`) REFERENCES `photos` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `banner_photo`
--
ALTER TABLE `banner_photo`
  ADD CONSTRAINT `banner_photo_photo_id_foreign` FOREIGN KEY (`photo_id`) REFERENCES `photos` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `cities`
--
ALTER TABLE `cities`
  ADD CONSTRAINT `cities_province_id_foreign` FOREIGN KEY (`province_id`) REFERENCES `provinces` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `manager_photo`
--
ALTER TABLE `manager_photo`
  ADD CONSTRAINT `manager_photo_photo_id_foreign` FOREIGN KEY (`photo_id`) REFERENCES `photos` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `photo_product`
--
ALTER TABLE `photo_product`
  ADD CONSTRAINT `photo_product_photo_id_foreign` FOREIGN KEY (`photo_id`) REFERENCES `photos` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
